{
    "package_name": "Buenos Aires City Experience",
    "country": "Argentina",
    "duration_days": 4,
    "customer_rating": 4.8,
    "places_to_visit": [
      {
        "name": "Plaza de Mayo",
        "description": "Plaza de Mayo is a historic square in Buenos Aires, known for its significant role in Argentine history. It is home to the Casa Rosada, the presidential palace, and the Metropolitan Cathedral. The plaza has been the site of many important political and social events."
      },
      {
        "name": "Recoleta Cemetery",
        "description": "Recoleta Cemetery is a famous and historic cemetery known for its elaborate mausoleums and statues. It is the final resting place of many notable figures, including Eva Perón. The cemetery is renowned for its architectural beauty and historical significance."
      },
      {
        "name": "La Boca",
        "description": "La Boca is a colorful neighborhood in Buenos Aires known for its vibrant street art, tango music, and historic architecture. The area is famous for its brightly painted houses and the Caminito street, which is a popular spot for tourists and artists."
      },
      {
        "name": "Palermo",
        "description": "Palermo is a large and trendy neighborhood known for its parks, cafes, and nightlife. It includes Palermo Soho, known for its boutiques and restaurants, and Palermo Hollywood, known for its vibrant nightlife and entertainment options."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Buenos Aires",
        "hotels": ["Alvear Palace Hotel", "Four Seasons Hotel Buenos Aires", "Palacio Duhau - Park Hyatt Buenos Aires"],
        "restaurants": ["Don Julio", "El preferido de Palermo", "Tegui"]
      }
    ],
    "activities": [
      "Visit Plaza de Mayo and Casa Rosada",
      "Explore Recoleta Cemetery and its mausoleums",
      "Walk through the colorful streets of La Boca",
      "Relax and dine in the trendy Palermo neighborhood",
      "Enjoy a tango show or explore Buenos Aires’ vibrant nightlife"
    ],
    "tips_and_tricks": [
      "Be cautious of your belongings, especially in crowded areas.",
      "Try local Argentine cuisine, including empanadas and steak.",
      "Consider using public transportation or ride-sharing apps for convenience."
    ],
    "emergency_contacts": {
      "tour_guide": "+54 11 1234 5678",
      "local_police": "911",
      "embassy": "+54 11 5777 4000"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Buenos Aires",
        "activities": [
          "Arrival at Ezeiza International Airport and transfer to the hotel",
          "Briefing on the tour and rest",
          "Dinner at a local restaurant and overnight stay"
        ]
      },
      {
        "day": 2,
        "location": "Buenos Aires",
        "activities": [
          "Visit Plaza de Mayo and Casa Rosada in the morning",
          "Lunch at a local restaurant",
          "Afternoon visit to Recoleta Cemetery",
          "Dinner and overnight stay at the hotel"
        ]
      },
      {
        "day": 3,
        "location": "Buenos Aires",
        "activities": [
          "Explore the neighborhood of La Boca in the morning",
          "Lunch at a local café in La Boca",
          "Afternoon in Palermo for shopping or relaxation",
          "Dinner at a restaurant in Palermo and overnight stay"
        ]
      },
      {
        "day": 4,
        "location": "Buenos Aires",
        "activities": [
          "Free day for optional activities or further exploration",
          "Lunch at a local restaurant",
          "Evening tango show or nightlife experience",
          "Dinner and overnight stay at the hotel"
        ]
      },
      {
        "day": 5,
        "location": "Departure",
        "activities": [
          "Check-out from the hotel and transfer to the airport for departure"
        ]
      }
    ]
  }
  