{
    "package_name": "Barcelona Highlights",
    "country": "Spain",
    "duration_days": 5,
    "customer_rating": 4.7,
    "places_to_visit": [
      {
        "name": "Sagrada Familia",
        "description": "The Sagrada Familia is an iconic basilica designed by Antoni Gaudí. Known for its intricate facades and towering spires, it's a masterpiece of modernist architecture and a UNESCO World Heritage Site."
      },
      {
        "name": "Park Güell",
        "description": "Park Güell is a public park designed by Antoni Gaudí, featuring colorful mosaics, whimsical structures, and panoramic views of Barcelona. It's a great place to explore Gaudí's unique artistic style."
      },
      {
        "name": "La Rambla",
        "description": "La Rambla is a bustling street in the heart of Barcelona known for its vibrant atmosphere, street performers, shops, and cafes. It's a popular area for strolling and experiencing local life."
      },
      {
        "name": "Gothic Quarter",
        "description": "The Gothic Quarter is the historical center of Barcelona, characterized by narrow medieval streets, charming squares, and historic buildings like Barcelona Cathedral. It's a great area to explore on foot."
      },
      {
        "name": "Casa Batlló",
        "description": "Casa Batlló is another Gaudí masterpiece, known for its whimsical architecture, colorful facade, and intricate interior design. It's a prime example of modernist architecture and a must-visit landmark."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Barcelona",
        "hotels": ["Hotel Arts Barcelona", "W Barcelona", "Mandarin Oriental Barcelona"],
        "restaurants": ["Tickets Bar", "El Celler de Can Roca", "Cervecería Catalana"]
      }
    ],
    "activities": [
      "Visit the Sagrada Familia and explore its architectural wonders",
      "Stroll through Park Güell and enjoy the artistic designs",
      "Wander along La Rambla and experience local shops and street performances",
      "Explore the Gothic Quarter and its historical landmarks",
      "Tour Casa Batlló and admire its unique design"
    ],
    "tips_and_tricks": [
      "Book Sagrada Familia tickets in advance to avoid long lines.",
      "Wear comfortable shoes for exploring the Gothic Quarter.",
      "Try local Catalan dishes at restaurants in the Gothic Quarter."
    ],
    "emergency_contacts": {
      "tour_guide": "+34 93-555-1234",
      "local_police": "112",
      "embassy": "+34 93-555-5678"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Barcelona",
        "activities": [
          "Arrival at Barcelona-El Prat Airport and transfer to the hotel",
          "Briefing on the tour and rest",
          "Dinner at a local restaurant and overnight stay"
        ]
      },
      {
        "day": 2,
        "location": "Barcelona",
        "activities": [
          "Visit the Sagrada Familia in the morning",
          "Lunch at a nearby restaurant",
          "Explore Park Güell in the afternoon",
          "Dinner and overnight stay"
        ]
      },
      {
        "day": 3,
        "location": "Barcelona",
        "activities": [
          "Stroll along La Rambla in the morning",
          "Lunch at a local café",
          "Explore the Gothic Quarter in the afternoon",
          "Dinner at a traditional restaurant"
        ]
      },
      {
        "day": 4,
        "location": "Barcelona",
        "activities": [
          "Tour Casa Batlló in the morning",
          "Lunch at a local restaurant",
          "Free time for shopping or additional sightseeing",
          "Dinner and overnight stay"
        ]
      },
      {
        "day": 5,
        "location": "Departure",
        "activities": [
          "Free time for last-minute shopping or relaxation",
          "Lunch in Barcelona",
          "Transfer to the airport for departure"
        ]
      }
    ]
  }
  