{
    "package_name": "Salar de Uyuni Exploration",
    "country": "Bolivia",
    "duration_days": 5,
    "customer_rating": 4.8,
    "places_to_visit": [
      {
        "name": "Salar de Uyuni",
        "description": "Salar de Uyuni is the world’s largest salt flat, covering over 10,000 square kilometers. The vast, white landscape is formed by a thick crust of salt that creates a mirror effect during the rainy season, offering a surreal and breathtaking experience. The salt flat is surrounded by volcanoes and is home to unique wildlife and colorful lagoons."
      },
      {
        "name": "Isla Incahuasi",
        "description": "Isla Incahuasi, also known as Fish Island, is a striking island in the middle of Salar de Uyuni. It is covered with giant cacti and offers stunning views of the surrounding salt flat. The island is a popular spot for hiking and photography."
      },
      {
        "name": "Laguna Colorada",
        "description": "Laguna Colorada, or Red Lagoon, is a high-altitude lake known for its striking red color caused by algae and mineral deposits. It is home to large flocks of flamingos and offers picturesque views of the Andes mountains."
      },
      {
        "name": "Laguna Verde",
        "description": "Laguna Verde, or Green Lagoon, is a beautiful high-altitude lake known for its striking green color, which is caused by the high levels of copper in the water. It is situated at the base of the Licancabur Volcano and offers stunning views of the surrounding landscape."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Uyuni",
        "hotels": ["Hotel Luna Salada", "Hotel Salar de Uyuni", "Hotel Palacio de Sal"],
        "restaurants": ["Minuteman Pizza", "El Cuchara de Palo", "Restaurant Tonito"]
      }
    ],
    "activities": [
      "Explore Salar de Uyuni’s vast salt flats",
      "Visit Isla Incahuasi and its giant cacti",
      "See the colorful lagoons of Laguna Colorada and Laguna Verde",
      "Enjoy sunset and sunrise photography on the salt flats",
      "Experience local Bolivian cuisine"
    ],
    "tips_and_tricks": [
      "Bring warm clothing as temperatures can drop significantly at night.",
      "Prepare for high altitudes and stay hydrated.",
      "Bring plenty of sunscreen and sunglasses to protect against the intense sun reflection."
    ],
    "emergency_contacts": {
      "tour_guide": "+591 2 123 4567",
      "local_police": "110",
      "embassy": "+591 2 216 6300"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Uyuni",
        "activities": [
          "Arrival at Uyuni Airport and transfer to the hotel",
          "Briefing on the tour and rest",
          "Dinner at a local restaurant and overnight stay"
        ]
      },
      {
        "day": 2,
        "location": "Salar de Uyuni",
        "activities": [
          "Full-day tour of Salar de Uyuni",
          "Visit Isla Incahuasi",
          "Lunch at a local restaurant or picnic on the salt flats",
          "Sunset photography on the salt flats",
          "Dinner and overnight stay in Uyuni"
        ]
      },
      {
        "day": 3,
        "location": "Laguna Colorada",
        "activities": [
          "Drive to Laguna Colorada",
          "Explore the lagoon and its surrounding wildlife",
          "Lunch at a local restaurant or packed lunch",
          "Dinner and overnight stay at a nearby lodge"
        ]
      },
      {
        "day": 4,
        "location": "Laguna Verde",
        "activities": [
          "Drive to Laguna Verde",
          "Explore the lagoon and enjoy the views of Licancabur Volcano",
          "Lunch at a local restaurant or packed lunch",
          "Return to Uyuni for dinner and overnight stay"
        ]
      },
      {
        "day": 5,
        "location": "Departure",
        "activities": [
          "Check-out from the hotel and transfer to Uyuni Airport for departure"
        ]
      }
    ]
  }
  