{
    "package_name": "Okavango Delta: Water Wilderness Safari",
    "country": "Botswana",
    "duration_days": 6,
    "customer_rating": 4.8,
    "places_to_visit": [
      {
        "name": "Okavango Delta",
        "description": "The Okavango Delta is a vast inland delta in Botswana, known for its unique ecosystem and seasonal floods that create a lush paradise in the desert. The delta is home to diverse wildlife, including elephants, hippos, and lions, and offers a range of activities such as mokoro (dugout canoe) safaris, game drives, and birdwatching. The delta’s ever-changing landscape, with its lagoons, floodplains, and islands, provides an unparalleled safari experience."
      },
      {
        "name": "Moremi Game Reserve",
        "description": "Moremi Game Reserve is situated in the eastern part of the Okavango Delta and is one of the most renowned wildlife reserves in Africa. The reserve includes a variety of habitats, including savannah, forests, and wetlands. It is famous for its high concentration of predators, including lions and leopards, as well as its abundant birdlife. Moremi offers excellent game viewing opportunities and is a crucial part of the delta's ecosystem."
      },
      {
        "name": "Mokoro Safari",
        "description": "A mokoro safari is a traditional way to explore the waterways of the Okavango Delta. The mokoro, a dugout canoe, is guided by a poler who uses a long pole to navigate through the shallow waters. This serene and peaceful experience allows visitors to get up close with the delta’s flora and fauna while enjoying the tranquil surroundings."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Okavango Delta",
        "hotels": ["Belmond Eagle Island Lodge", "Sanctuary Chief’s Camp", "Xugana Island Lodge"],
        "restaurants": ["Lodge Dining", "Campfire Dining", "Picnic Lunches"]
      }
    ],
    "activities": [
      "Mokoro safari through the delta’s waterways",
      "Game drives in the Okavango Delta and Moremi Game Reserve",
      "Walking safaris with experienced guides",
      "Birdwatching and photography",
      "Scenic flights over the delta"
    ],
    "tips_and_tricks": [
      "Travel during the flood season (May to October) for the best water-based safaris.",
      "Bring lightweight, neutral-colored clothing and a wide-brimmed hat.",
      "Consider a guided safari for deeper insights into the delta’s ecosystem."
    ],
    "emergency_contacts": {
      "tour_guide": "+267 71 123 456",
      "local_police": "999",
      "embassy": "+267 395 0720"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Maun",
        "activities": [
          "Arrival at Maun International Airport and transfer to the lodge",
          "Briefing on the safari and equipment check",
          "Dinner at the lodge and overnight stay"
        ]
      },
      {
        "day": 2,
        "location": "Okavango Delta",
        "activities": [
          "Fly into the Okavango Delta",
          "Transfer to the lodge and check-in",
          "Afternoon mokoro safari and exploration of the delta’s waterways",
          "Dinner and overnight at the lodge"
        ]
      },
      {
        "day": 3,
        "location": "Okavango Delta",
        "activities": [
          "Morning game drive in the Okavango Delta",
          "Lunch at the lodge",
          "Afternoon walking safari or birdwatching",
          "Dinner and overnight at the lodge"
        ]
      },
      {
        "day": 4,
        "location": "Moremi Game Reserve",
        "activities": [
          "Fly to Moremi Game Reserve",
          "Check-in at the lodge and lunch",
          "Afternoon game drive in the reserve",
          "Dinner and overnight at the lodge"
        ]
      },
      {
        "day": 5,
        "location": "Moremi Game Reserve",
        "activities": [
          "Full-day game drive in Moremi",
          "Lunch in the reserve or at the lodge",
          "Evening game drive or walking safari",
          "Dinner and overnight at the lodge"
        ]
      },
      {
        "day": 6,
        "location": "Maun",
        "activities": [
          "Fly back to Maun",
          "Lunch at a local restaurant",
          "Free time for shopping or exploring Maun",
          "Dinner and overnight at the hotel"
        ]
      },
      {
        "day": 7,
        "location": "Departure",
        "activities": [
          "Check-out from the hotel and transfer to Maun International Airport for departure"
        ]
      }
    ]
  }
  