{
    "package_name": "Colombia Highlights: Bogotá and Medellín",
    "country": "Colombia",
    "duration_days": 6,
    "customer_rating": 4.6,
    "places_to_visit": [
      {
        "name": "Bogotá",
        "description": "Bogotá, the capital of Colombia, is a city rich in culture and history. Key attractions include the Gold Museum, which houses an impressive collection of pre-Columbian gold artifacts, and the historic Candelaria neighborhood, known for its colonial architecture and vibrant street art."
      },
      {
        "name": "Monserrate",
        "description": "Monserrate is a mountain that overlooks Bogotá and is accessible via a cable car or funicular. At the top, visitors can enjoy panoramic views of the city and visit the Sanctuary of Monserrate, a popular pilgrimage site."
      },
      {
        "name": "Medellín",
        "description": "Medellín is known for its transformation into a modern, vibrant city with a rich cultural scene. Key attractions include the Plaza Botero, featuring sculptures by the famous artist Fernando Botero, and the Medellín Metrocable, offering stunning views of the city and surrounding mountains."
      },
      {
        "name": "Comuna 13",
        "description": "Comuna 13 is a neighborhood in Medellín known for its vibrant street art and cultural transformation. It has become a popular destination for guided tours that showcase its history and artistic expressions."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Bogotá",
        "hotels": ["Hotel de la Opera", "Four Seasons Hotel Bogotá", "Sofitel Bogotá Victoria Regia"],
        "restaurants": ["Andres Carne de Res", "Harry Sasson", "Café San Alberto"]
      },
      {
        "location": "Medellín",
        "hotels": ["Hotel Charlee", "The Click Clack Hotel", "NH Collection Medellín"],
        "restaurants": ["Oci.Mde", "Café Zorba", "El Cielo"]
      }
    ],
    "activities": [
      "Visit the Gold Museum and Candelaria neighborhood in Bogotá",
      "Ride the cable car to Monserrate",
      "Explore Medellín’s cultural sites, including Plaza Botero and Comuna 13",
      "Take a ride on the Medellín Metrocable",
      "Enjoy local Colombian cuisine and nightlife"
    ],
    "tips_and_tricks": [
      "Be mindful of altitude in Bogotá and take it easy on your first day.",
      "Use local transportation or ride-sharing apps for convenience.",
      "Try local Colombian dishes, including arepas and bandeja paisa."
    ],
    "emergency_contacts": {
      "tour_guide": "+57 1 234 5678",
      "local_police": "123",
      "embassy": "+57 1 600 2300"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Bogotá",
        "activities": [
          "Arrival at El Dorado International Airport and transfer to the hotel",
          "Briefing on the tour and rest",
          "Dinner at a local restaurant and overnight stay"
        ]
      },
      {
        "day": 2,
        "location": "Bogotá",
        "activities": [
          "Visit the Gold Museum and Candelaria neighborhood in the morning",
          "Lunch at a local restaurant",
          "Ride the cable car to Monserrate in the afternoon",
          "Dinner and overnight at the hotel"
        ]
      },
      {
        "day": 3,
        "location": "Medellín",
        "activities": [
          "Fly to Medellín and transfer to the hotel",
          "Explore Plaza Botero and the city center",
          "Lunch at a local restaurant",
          "Visit Comuna 13 and its street art",
          "Dinner and overnight at the hotel"
        ]
      },
      {
        "day": 4,
        "location": "Medellín",
        "activities": [
          "Take the Medellín Metrocable for panoramic views",
          "Lunch at a local café",
          "Explore the nearby parks and cultural sites",
          "Dinner and overnight at the hotel"
        ]
      },
      {
        "day": 5,
        "location": "Medellín",
        "activities": [
          "Free day for optional activities or further exploration",
          "Lunch at a local restaurant",
          "Evening free to enjoy Medellín’s nightlife",
          "Dinner and overnight stay"
        ]
      },
      {
        "day": 6,
        "location": "Departure",
        "activities": [
          "Check-out from the hotel and transfer to the airport for departure"
        ]
      }
    ]
  }
  