{
    "package_name": "Angkor Wat Discovery",
    "country": "Cambodia",
    "duration_days": 4,
    "customer_rating": 4.8,
    "places_to_visit": [
      {
        "name": "Angkor Wat",
        "description": "Angkor Wat is a massive temple complex in Cambodia and one of the most important archaeological sites in Southeast Asia. Originally constructed as a Hindu temple, it later became a Buddhist temple. Its extensive bas-reliefs and architecture are celebrated for their grandeur and detail."
      },
      {
        "name": "Angkor Thom",
        "description": "Angkor Thom is a fortified city and the last capital of the Khmer Empire. Key structures within Angkor Thom include the Bayon Temple with its iconic stone faces, the Baphuon Temple, and the Terrace of the Elephants."
      },
      {
        "name": "Ta Prohm",
        "description": "Ta Prohm is a temple known for its dramatic ruins overgrown with massive tree roots. It is famous for its appearance in the film 'Tomb Raider' and offers a unique glimpse into how nature and architecture intertwine."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Siem Reap",
        "hotels": ["Belmond La Résidence d'Angkor", "Shinta Mani Shack", "Raffles Grand Hotel d'Angkor"],
        "restaurants": ["Cuisine Wat Damnak", "The Square 24", "Mikereang Restaurant"]
      }
    ],
    "activities": [
      "Explore the Angkor Wat temple complex, including its bas-reliefs and central sanctuary",
      "Tour Angkor Thom, including the Bayon Temple and Terrace of the Elephants",
      "Visit Ta Prohm and marvel at its overgrown ruins"
    ],
    "tips_and_tricks": [
      "Wear comfortable walking shoes and bring sunscreen for temple exploration.",
      "Hire a local guide to get detailed insights into the historical significance of the sites.",
      "Consider a sunrise tour of Angkor Wat for a memorable experience."
    ],
    "emergency_contacts": {
      "tour_guide": "+855 63-555-123",
      "local_police": "117",
      "embassy": "+855 63-555-567"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Siem Reap",
        "activities": [
          "Arrival at Siem Reap International Airport and transfer to the hotel",
          "Briefing on the tour and rest",
          "Dinner at a local restaurant and overnight stay"
        ]
      },
      {
        "day": 2,
        "location": "Angkor Wat",
        "activities": [
          "Full-day exploration of Angkor Wat, including the central sanctuary and outer temples",
          "Lunch at a local café",
          "Dinner and overnight stay at the hotel"
        ]
      },
      {
        "day": 3,
        "location": "Angkor Thom and Ta Prohm",
        "activities": [
          "Explore Angkor Thom, including the Bayon Temple and Terrace of the Elephants",
          "Lunch at a nearby restaurant",
          "Visit Ta Prohm in the afternoon",
          "Dinner and overnight stay"
        ]
      },
      {
        "day": 4,
        "location": "Siem Reap",
        "activities": [
          "Free time for shopping or additional sightseeing in Siem Reap",
          "Lunch at a local café",
          "Dinner and transfer to the airport for departure"
        ]
      }
    ]
  }
  