{
    "package_name": "Edinburgh Highlights",
    "country": "United Kingdom",
    "duration_days": 4,
    "customer_rating": 4.7,
    "places_to_visit": [
      {
        "name": "Edinburgh Castle",
        "description": "Edinburgh Castle is a historic fortress perched on Castle Rock. It offers stunning views of the city and houses the Crown Jewels of Scotland and the Stone of Destiny."
      },
      {
        "name": "Royal Mile",
        "description": "The Royal Mile is a historic street in Edinburgh that runs through the Old Town. It is lined with shops, restaurants, and historic landmarks, including St Giles’ Cathedral."
      },
      {
        "name": "Holyrood Palace",
        "description": "Holyrood Palace is the official residence of the British monarch in Scotland. Visitors can explore the State Apartments and the ruins of the 12th-century Holyrood Abbey."
      },
      {
        "name": "Arthur’s Seat",
        "description": "Arthur’s Seat is an extinct volcano and a popular hiking spot offering panoramic views of Edinburgh. It’s a great place for a nature walk and to see the city from above."
      },
      {
        "name": "National Museum of Scotland",
        "description": "The National Museum of Scotland features diverse collections ranging from Scottish history and culture to natural history and world cultures."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Edinburgh",
        "hotels": ["The Balmoral", "The Scotsman Hotel", "Radisson Blu Hotel"],
        "restaurants": ["The Kitchin", "The Witchery by the Castle", "Number One at Balmoral"]
      }
    ],
    "activities": [
      "Explore Edinburgh Castle and its treasures",
      "Stroll along the Royal Mile and visit St Giles’ Cathedral",
      "Tour Holyrood Palace and see its historic rooms",
      "Hike up Arthur’s Seat for breathtaking city views",
      "Discover exhibits at the National Museum of Scotland"
    ],
    "tips_and_tricks": [
      "Wear comfortable shoes for walking and hiking.",
      "Book tickets for Edinburgh Castle and Holyrood Palace in advance.",
      "Check the weather before hiking Arthur’s Seat and dress appropriately."
    ],
    "emergency_contacts": {
      "tour_guide": "+44 131-555-1234",
      "local_police": "999",
      "embassy": "+44 131-555-5678"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Edinburgh",
        "activities": [
          "Arrival at Edinburgh Airport and transfer to the hotel",
          "Briefing on the tour and rest",
          "Dinner at a local restaurant and overnight stay"
        ]
      },
      {
        "day": 2,
        "location": "Edinburgh",
        "activities": [
          "Visit Edinburgh Castle in the morning",
          "Lunch in the area",
          "Stroll along the Royal Mile and visit St Giles’ Cathedral in the afternoon",
          "Dinner and overnight stay"
        ]
      },
      {
        "day": 3,
        "location": "Edinburgh",
        "activities": [
          "Tour Holyrood Palace in the morning",
          "Lunch at a local restaurant",
          "Hike up Arthur’s Seat in the afternoon",
          "Dinner and evening at leisure"
        ]
      },
      {
        "day": 4,
        "location": "Edinburgh",
        "activities": [
          "Visit the National Museum of Scotland in the morning",
          "Lunch in Edinburgh",
          "Free time for additional sightseeing or shopping",
          "Transfer to the airport for departure"
        ]
      }
    ]
  }
  