{
    "package_name": "Great Wall of China Tour",
    "country": "China",
    "duration_days": 5,
    "customer_rating": 4.8,
    "places_to_visit": [
      {
        "name": "The Great Wall of China",
        "description": "The Great Wall of China is a series of fortifications made of various materials, including earth, wood, and stone, built to protect Chinese states and empires from invasions. It stretches over 13,000 miles and includes several sections such as Badaling and Mutianyu."
      },
      {
        "name": "Beijing",
        "description": "Beijing, the capital of China, is home to several historical landmarks such as the Forbidden City, the Temple of Heaven, and Tiananmen Square. The city serves as a gateway to various sections of the Great Wall."
      },
      {
        "name": "Jinshanling Great Wall",
        "description": "Jinshanling is one of the best-preserved sections of the Great Wall, known for its picturesque landscapes and relatively untouched state. It provides a less crowded experience compared to more popular sections."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Beijing",
        "hotels": ["The Peninsula Beijing", "The Ritz-Carlton Beijing", "Waldorf Astoria Beijing"],
        "restaurants": ["Quanjude Roast Duck", "Duck de Chine", "The Lounge"]
      }
    ],
    "activities": [
      "Hike along the Great Wall at Badaling or Mutianyu",
      "Explore Beijing's historical sites including the Forbidden City and Tiananmen Square",
      "Visit the less-traveled Jinshanling section of the Great Wall for a more serene experience"
    ],
    "tips_and_tricks": [
      "Wear comfortable walking shoes and bring water for hiking on the Great Wall.",
      "Use public transport or guided tours to navigate Beijing efficiently.",
      "Visit the Great Wall early in the day to avoid crowds."
    ],
    "emergency_contacts": {
      "tour_guide": "+86 10-5555-1234",
      "local_police": "110",
      "embassy": "+86 10-5555-5678"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Beijing",
        "activities": [
          "Arrival at Beijing Capital International Airport and transfer to the hotel",
          "Briefing on the tour and rest",
          "Dinner at a local restaurant and overnight stay"
        ]
      },
      {
        "day": 2,
        "location": "Beijing",
        "activities": [
          "Visit the Forbidden City and Tiananmen Square in the morning",
          "Lunch at a local restaurant",
          "Explore the Temple of Heaven in the afternoon",
          "Dinner and overnight stay at the hotel"
        ]
      },
      {
        "day": 3,
        "location": "Great Wall - Badaling or Mutianyu",
        "activities": [
          "Travel to the Great Wall section of Badaling or Mutianyu",
          "Full-day hiking and exploration of the Wall",
          "Lunch at a local restaurant near the Wall",
          "Return to Beijing in the evening",
          "Dinner and overnight stay"
        ]
      },
      {
        "day": 4,
        "location": "Great Wall - Jinshanling",
        "activities": [
          "Travel to Jinshanling for a less crowded Great Wall experience",
          "Hike and explore the Jinshanling section",
          "Lunch in the area",
          "Return to Beijing and enjoy the evening at leisure",
          "Dinner and overnight stay"
        ]
      },
      {
        "day": 5,
        "location": "Departure",
        "activities": [
          "Check-out from the hotel and transfer to the airport for departure"
        ]
      }
    ]
  }
  