{
    "package_name": "Los Angeles Adventure",
    "country": "USA",
    "duration_days": 5,
    "customer_rating": 4.7,
    "places_to_visit": [
      {
        "name": "Hollywood Walk of Fame",
        "description": "The Hollywood Walk of Fame features over 2,600 brass stars embedded in the sidewalks along Hollywood Boulevard. It's a famous attraction where visitors can see the names of celebrities and enjoy nearby theaters and attractions."
      },
      {
        "name": "Griffith Observatory",
        "description": "The Griffith Observatory offers breathtaking views of Los Angeles and the Hollywood Sign. It features exhibits on astronomy and space science, along with a planetarium for immersive shows."
      },
      {
        "name": "Santa Monica Pier",
        "description": "Santa Monica Pier is a historic landmark with an amusement park, aquarium, and family-friendly attractions. The pier's location provides beautiful ocean views and a lively atmosphere."
      },
      {
        "name": "Getty Center",
        "description": "The Getty Center is an art museum known for its impressive art collection, stunning architecture, and beautifully landscaped gardens. It offers a range of exhibitions and educational programs."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Los Angeles",
        "hotels": ["The Hollywood Roosevelt", "The Beverly Hills Hotel", "Hotel Bel-Air"],
        "restaurants": ["Bestia", "n/naka", "République"]
      }
    ],
    "activities": [
      "Walk along the Hollywood Walk of Fame and explore nearby attractions",
      "Visit the Griffith Observatory for views and astronomy exhibits",
      "Enjoy a day at Santa Monica Pier with its amusement park and aquarium",
      "Explore the Getty Center’s art collections and gardens"
    ],
    "tips_and_tricks": [
      "Use ride-sharing apps to navigate Los Angeles traffic.",
      "Check the schedule for the Griffith Observatory's public programs.",
      "Visit Santa Monica Pier early in the day to avoid crowds."
    ],
    "emergency_contacts": {
      "tour_guide": "+1 323-555-1234",
      "local_police": "911",
      "embassy": "+1 323-555-5678"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Los Angeles",
        "activities": [
          "Arrival at Los Angeles International Airport and transfer to the hotel",
          "Briefing on the tour and rest",
          "Dinner at a local restaurant and overnight stay"
        ]
      },
      {
        "day": 2,
        "location": "Los Angeles",
        "activities": [
          "Explore the Hollywood Walk of Fame in the morning",
          "Lunch at a nearby café",
          "Visit the Griffith Observatory in the afternoon",
          "Dinner and overnight stay at the hotel"
        ]
      },
      {
        "day": 3,
        "location": "Los Angeles",
        "activities": [
          "Spend the day at Santa Monica Pier",
          "Lunch at a pier restaurant",
          "Return to the city and explore the local area",
          "Dinner and overnight stay"
        ]
      },
      {
        "day": 4,
        "location": "Los Angeles",
        "activities": [
          "Visit the Getty Center in the morning",
          "Lunch at a nearby restaurant",
          "Afternoon free for shopping or additional sightseeing",
          "Dinner at a top-rated restaurant and overnight stay"
        ]
      },
      {
        "day": 5,
        "location": "Departure",
        "activities": [
          "Check-out from the hotel and transfer to the airport for departure"
        ]
      }
    ]
  }
  