{
    "package_name": "Mali Adventure Tour",
    "country": "Mali",
    "duration_days": 7,
    "customer_rating": 4.5,
    "places_to_visit": [
      {
        "name": "Bamako",
        "description": "Bamako, the capital of Mali, is a bustling city known for its lively markets, cultural museums, and vibrant atmosphere. Key attractions include the National Museum of Mali, which displays artifacts and exhibits about Mali's diverse cultures and history, and the Grand Mosque, a notable landmark."
      },
      {
        "name": "Timbuktu",
        "description": "Timbuktu is a historic city with a rich heritage and cultural significance. Known for its ancient mosques and manuscripts, it also offers a unique desert experience and vibrant local markets. The city's architecture and history make it a fascinating destination."
      },
      {
        "name": "Djenné",
        "description": "Djenné is renowned for its stunning mud-brick architecture, including the famous Djenné Mosque, the largest mud structure in the world. The city’s traditional market and historic architecture provide an immersive cultural experience."
      },
      {
        "name": "Ségou",
        "description": "Ségou, located along the Niger River, is known for its scenic riverbanks and traditional markets. The town offers a glimpse into Malian culture and history, with various local crafts and activities along the river."
      },
      {
        "name": "Mopti",
        "description": "Mopti is a lively port town on the Niger River, famous for its riverboat cruises and vibrant markets. It serves as a gateway to the Bandiagara Escarpment and traditional villages in the surrounding region."
      },
      {
        "name": "Bandiagara Escarpment",
        "description": "The Bandiagara Escarpment is a dramatic sandstone cliff that stretches for over 150 kilometers. It is home to the Dogon people, known for their unique architecture and traditional practices. The area offers stunning landscapes and cultural experiences."
      },
      {
        "name": "Gao",
        "description": "Gao is an ancient city with historical significance as a former capital of the Songhai Empire. It features historic sites and serves as a gateway to explore the Niger River and its surrounding areas."
      },
      {
        "name": "Fela Kuti House",
        "description": "In Bamako, visit the house where the legendary musician Fela Kuti lived. It offers insights into his life and contributions to music, providing a cultural touchpoint for visitors interested in modern Malian history."
      },
      {
        "name": "Lake Horo",
        "description": "Lake Horo, located near Ségou, is a serene spot for relaxation and bird-watching. It’s a peaceful area to enjoy the natural beauty and engage in activities like fishing and boat rides."
      },
      {
        "name": "Niafunké",
        "description": "Niafunké is a small town known for its music and traditional festivals. It’s a great place to experience local Malian music and cultural celebrations."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Bamako",
        "hotels": ["Hotel l'Amitié", "Laico Hôtel El Farouk", "Radisson Blu Hotel Bamako"],
        "restaurants": ["Le Loft", "La Maison des Amis", "Restaurant du Fleuve"]
      },
      {
        "location": "Timbuktu",
        "hotels": ["Hotel La Maison des Ambassadeurs", "Auberge Grand Hotel"],
        "restaurants": ["La Maison des Ambassadeurs Restaurant", "Le Relais des Voyageurs"]
      },
      {
        "location": "Djenné",
        "hotels": ["Hotel Djenné Djenno", "Auberge La Falaise"],
        "restaurants": ["Restaurant La Falaise", "Le Jardin de Djenné"]
      },
      {
        "location": "Ségou",
        "hotels": ["Hotel L'Auberge de Ségou", "Hôtel Koro"],
        "restaurants": ["Le Bistro de Ségou", "Restaurant Le Gourmet"]
      }
    ],
    "activities": [
      "Explore the vibrant markets and cultural sites of Bamako",
      "Visit Timbuktu's historic sites and local markets",
      "Discover the mud-brick architecture of Djenné and its traditional market",
      "Enjoy the scenic riverbanks and traditional crafts in Ségou",
      "Experience riverboat cruises and local culture in Mopti",
      "Hike and explore the Bandiagara Escarpment and learn about the Dogon people",
      "Relax by Lake Horo and enjoy bird-watching",
      "Attend local music festivals and cultural events in Niafunké"
    ],
    "tips_and_tricks": [
      "Ensure you have all necessary travel documents and permits for visiting Mali.",
      "Travel with a local guide to enhance your experience and understanding of the sites.",
      "Stay hydrated and protect yourself from the sun while exploring outdoor sites."
    ],
    "emergency_contacts": {
      "tour_guide": "+223 20-555-1234",
      "local_police": "17",
      "embassy": "+223 20-555-5678"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Bamako",
        "activities": [
          "Arrival at Bamako-Sénou International Airport and transfer to the hotel",
          "Briefing on the tour and rest",
          "Dinner at a local restaurant and overnight stay"
        ]
      },
      {
        "day": 2,
        "location": "Bamako",
        "activities": [
          "Visit the National Museum of Mali in the morning",
          "Lunch at a local café",
          "Explore the Grand Mosque and local markets in the afternoon",
          "Dinner and overnight stay"
        ]
      },
      {
        "day": 3,
        "location": "Timbuktu",
        "activities": [
          "Travel to Timbuktu",
          "Explore the Djinguereber Mosque and Sankore University",
          "Lunch at a local restaurant",
          "Visit local markets and historical sites",
          "Dinner and overnight stay"
        ]
      },
      {
        "day": 4,
        "location": "Djenné",
        "activities": [
          "Travel to Djenné",
          "Visit the Djenné Mosque and local markets",
          "Lunch at a local restaurant",
          "Explore the traditional mud-brick architecture",
          "Dinner and overnight stay"
        ]
      },
      {
        "day": 5,
        "location": "Ségou",
        "activities": [
          "Travel to Ségou",
          "Explore the scenic riverbanks and traditional markets",
          "Lunch at a local café",
          "Relax and enjoy riverboat activities",
          "Dinner and overnight stay"
        ]
      },
      {
        "day": 6,
        "location": "Mopti",
        "activities": [
          "Travel to Mopti",
          "Experience riverboat cruises and visit traditional villages",
          "Lunch at a local restaurant",
          "Explore local markets and cultural sites",
          "Dinner and overnight stay"
        ]
      },
      {
        "day": 7,
        "location": "Departure",
        "activities": [
          "Return to Bamako",
          "Free time for last-minute shopping or additional sightseeing",
          "Lunch in Bamako",
          "Transfer to the airport for departure"
        ]
      }
    ]
  }
  