{
    "package_name": "Paris Highlights Tour",
    "country": "France",
    "duration_days": 5,
    "customer_rating": 4.9,
    "places_to_visit": [
      {
        "name": "Eiffel Tower",
        "attractions": [
          "Summit Observation Deck",
          "Second Floor Viewing Platform",
          "Champ de Mars Gardens"
        ],
        "description": "The Eiffel Tower, an iconic symbol of Paris, offers stunning views from its observation decks. The summit provides a panoramic view of the city, while the second floor offers a closer look at Paris’s landmarks. The surrounding Champ de Mars Gardens are perfect for a leisurely stroll and a great spot for photos."
      },
      {
        "name": "Louvre Museum",
        "attractions": [
          "Mona Lisa",
          "Venus de Milo",
          "Egyptian Antiquities",
          "Grand Gallery"
        ],
        "description": "The Louvre Museum is the world’s largest art museum and a historic monument in Paris. It houses thousands of works of art, including Leonardo da Vinci’s Mona Lisa and the Venus de Milo. The Egyptian Antiquities collection and the Grand Gallery, featuring masterpieces from various periods, are highlights of this iconic museum."
      },
      {
        "name": "Notre-Dame Cathedral",
        "attractions": [
          "Gothic Architecture",
          "Rose Windows",
          "Sainte-Chapelle Nearby"
        ],
        "description": "Notre-Dame Cathedral, a masterpiece of Gothic architecture, is renowned for its impressive façade, stunning rose windows, and intricate stone carvings. Although it was damaged by fire in 2019, its historical and architectural significance remains a major attraction. Sainte-Chapelle, located nearby, is famous for its breathtaking stained glass windows."
      },
      {
        "name": "Montmartre",
        "attractions": [
          "Sacré-Cœur Basilica",
          "Place du Tertre",
          "Moulin Rouge",
          "Montmartre Cemetery"
        ],
        "description": "Montmartre is a historic district known for its artistic heritage. The Sacré-Cœur Basilica, perched on the highest point in Paris, offers panoramic views of the city. Place du Tertre is a lively square where artists display their work. The iconic Moulin Rouge and the serene Montmartre Cemetery, the resting place of many famous artists, are also notable landmarks."
      },
      {
        "name": "Champs-Élysées and Arc de Triomphe",
        "attractions": [
          "Arc de Triomphe",
          "Champs-Élysées Shopping",
          "Place de la Concorde"
        ],
        "description": "The Champs-Élysées is one of the most famous avenues in the world, known for its high-end shops, cafes, and theaters. At its western end stands the Arc de Triomphe, a monumental arch honoring those who fought and died for France. Nearby, Place de la Concorde is a historic square with impressive fountains and obelisks."
      },
      {
        "name": "Palace of Versailles",
        "attractions": [
          "Hall of Mirrors",
          "Versailles Gardens",
          "Grand Trianon",
          "Petit Trianon"
        ],
        "description": "The Palace of Versailles, a UNESCO World Heritage site, is renowned for its opulent architecture and stunning gardens. The Hall of Mirrors is a highlight, reflecting the grandeur of the French monarchy. The extensive Versailles Gardens, Grand Trianon, and Petit Trianon provide a glimpse into the royal lifestyle and exquisite landscape design."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Paris",
        "hotels": ["Le Meurice", "The Ritz Paris", "Hotel Lutetia"],
        "restaurants": ["Le Jules Verne", "L’Astrance", "Le Comptoir du Relais"]
      }
    ],
    "activities": [
      "Guided tours of major landmarks",
      "Cruise on the Seine River",
      "Visit to historic neighborhoods",
      "Dining at renowned Parisian restaurants"
    ],
    "tips_and_tricks": [
      "Purchase tickets for major attractions in advance to avoid long lines.",
      "Wear comfortable walking shoes as Paris is best explored on foot.",
      "Learn a few basic French phrases to enhance your experience.",
      "Keep an eye on your belongings, especially in crowded areas."
    ],
    "emergency_contacts": {
      "tour_guide": "+33 123 456 789",
      "local_police": "17",
      "tourist_police": "+33 1 45 55 61 32",
      "embassy": "+33 1 43 12 88 00"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Paris",
        "activities": [
          "Arrival at Charles de Gaulle Airport",
          "Transfer to the hotel and check-in",
          "Leisurely stroll around the hotel area",
          "Dinner at Le Comptoir du Relais"
        ]
      },
      {
        "day": 2,
        "location": "Paris",
        "activities": [
          "Visit the Eiffel Tower (morning)",
          "Lunch at a local café near the Eiffel Tower",
          "Explore the Louvre Museum (afternoon)",
          "Dinner at Le Jules Verne (Eiffel Tower restaurant)"
        ]
      },
      {
        "day": 3,
        "location": "Paris",
        "activities": [
          "Visit Notre-Dame Cathedral and Sainte-Chapelle (morning)",
          "Lunch at a nearby restaurant",
          "Afternoon visit to Montmartre: Sacré-Cœur Basilica and Place du Tertre",
          "Dinner at L’Astrance"
        ]
      },
      {
        "day": 4,
        "location": "Paris",
        "activities": [
          "Explore Champs-Élysées and Arc de Triomphe (morning)",
          "Lunch at a local bistro on the Champs-Élysées",
          "Visit the Palace of Versailles (afternoon)",
          "Return to Paris and dinner at a local restaurant"
        ]
      },
      {
        "day": 5,
        "location": "Paris",
        "activities": [
          "Free time for shopping or sightseeing",
          "Lunch at a local café",
          "Relax or take a Seine River cruise",
          "Check-out from the hotel",
          "Transfer to Charles de Gaulle Airport for departure"
        ]
      }
    ]
  }
  