{
    "package_name": "Lisbon Experience",
    "country": "Portugal",
    "duration_days": 4,
    "customer_rating": 4.5,
    "places_to_visit": [
      {
        "name": "Belém Tower",
        "description": "Belém Tower is a historic fortification on the banks of the Tagus River. It was built in the early 16th century and is a symbol of Portugal’s Age of Discoveries."
      },
      {
        "name": "Jerónimos Monastery",
        "description": "Jerónimos Monastery is a stunning example of Manueline architecture. It houses the tombs of famous Portuguese explorers and is a UNESCO World Heritage Site."
      },
      {
        "name": "Alfama District",
        "description": "The Alfama District is the oldest neighborhood in Lisbon, known for its narrow streets, historic buildings, and Fado music. It offers a glimpse into traditional Lisbon life."
      },
      {
        "name": "Lisbon Oceanarium",
        "description": "Lisbon Oceanarium is one of the largest indoor aquariums in the world. It features a diverse range of marine life and offers educational and interactive exhibits."
      },
      {
        "name": "Rossio Square",
        "description": "Rossio Square is a central public square in Lisbon known for its beautiful pavement designs, historic buildings, and vibrant atmosphere. It’s a great spot for people-watching and relaxation."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Lisbon",
        "hotels": ["Pestana Palace Lisboa", "Four Seasons Hotel Ritz Lisbon", "Lisbon Marriott Hotel"],
        "restaurants": ["Belcanto", "Time Out Market Lisbon", "Ramiro"]
      }
    ],
    "activities": [
      "Visit Belém Tower and learn about Portugal’s maritime history",
      "Explore Jerónimos Monastery and its historical significance",
      "Wander through the Alfama District and enjoy traditional Fado music",
      "Visit the Lisbon Oceanarium and see marine life",
      "Relax at Rossio Square and enjoy local cafes"
    ],
    "tips_and_tricks": [
      "Try the famous Pastéis de Belém at a local bakery.",
      "Wear comfortable shoes for exploring the Alfama District’s hills.",
      "Consider using public transport or trams to navigate the city's hills."
    ],
    "emergency_contacts": {
      "tour_guide": "+351 21-555-1234",
      "local_police": "112",
      "embassy": "+351 21-555-5678"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Lisbon",
        "activities": [
          "Arrival at Lisbon Airport and transfer to the hotel",
          "Briefing on the tour and rest",
          "Dinner at a local restaurant and overnight stay"
        ]
      },
      {
        "day": 2,
        "location": "Lisbon",
        "activities": [
          "Visit Belém Tower in the morning",
          "Lunch at a nearby café",
          "Explore Jerónimos Monastery in the afternoon",
          "Dinner and overnight stay"
        ]
      },
      {
        "day": 3,
        "location": "Lisbon",
        "activities": [
          "Wander through the Alfama District in the morning",
          "Lunch at a traditional restaurant",
          "Visit the Lisbon Oceanarium in the afternoon",
          "Dinner and evening at Rossio Square"
        ]
      },
      {
        "day": 4,
        "location": "Lisbon",
        "activities": [
          "Free time for additional sightseeing or shopping",
          "Lunch in Lisbon",
          "Transfer to the airport for departure"
        ]
      }
    ]
  }
  