{
    "package_name": "Prague Exploration",
    "country": "Czech Republic",
    "duration_days": 4,
    "customer_rating": 4.7,
    "places_to_visit": [
      {
        "name": "Prague Castle",
        "description": "Prague Castle is a historic castle complex that includes the Gothic-style St. Vitus Cathedral, the Old Royal Palace, and the charming Golden Lane. It's a major cultural and architectural landmark in Prague."
      },
      {
        "name": "Charles Bridge",
        "description": "Charles Bridge is a historic stone bridge connecting the Old Town and Lesser Town of Prague. It offers stunning views of the Vltava River and features numerous statues of saints along its length."
      },
      {
        "name": "Old Town Square",
        "description": "Old Town Square is the historic heart of Prague, known for its colorful buildings, the Astronomical Clock, and the Týn Church. It's a lively area with shops, cafes, and street performers."
      },
      {
        "name": "Wenceslas Square",
        "description": "Wenceslas Square is a major commercial and cultural center in Prague. It features the National Museum, historical monuments, and is a hub for shopping and dining."
      },
      {
        "name": "John Lennon Wall",
        "description": "The John Lennon Wall is a colorful tribute to John Lennon and a symbol of freedom and peace. It’s covered in Beatles-inspired graffiti and offers a unique and vibrant photo opportunity."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Prague",
        "hotels": ["Hotel Kings Court", "Aria Hotel Prague", "The Grand Mark Prague"],
        "restaurants": ["Mlýnec", "Café Slavia", "Eska"]
      }
    ],
    "activities": [
      "Explore the Prague Castle and its various historic sites",
      "Walk across Charles Bridge and take in the views",
      "Visit Old Town Square and see the Astronomical Clock",
      "Stroll through Wenceslas Square and visit the National Museum",
      "See the colorful John Lennon Wall"
    ],
    "tips_and_tricks": [
      "Wear comfortable shoes for exploring the cobbled streets.",
      "Try local Czech cuisine, such as goulash and dumplings, at traditional restaurants.",
      "Be cautious of pickpockets in crowded areas."
    ],
    "emergency_contacts": {
      "tour_guide": "+420 2-555-1234",
      "local_police": "158",
      "embassy": "+420 2-555-5678"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Prague",
        "activities": [
          "Arrival at Václav Havel Airport and transfer to the hotel",
          "Briefing on the tour and rest",
          "Dinner at a local restaurant and overnight stay"
        ]
      },
      {
        "day": 2,
        "location": "Prague",
        "activities": [
          "Visit Prague Castle in the morning",
          "Lunch at a nearby café",
          "Explore Charles Bridge and its surroundings in the afternoon",
          "Dinner and overnight stay"
        ]
      },
      {
        "day": 3,
        "location": "Prague",
        "activities": [
          "Visit Old Town Square and see the Astronomical Clock in the morning",
          "Lunch at a local restaurant",
          "Stroll through Wenceslas Square in the afternoon",
          "Visit the John Lennon Wall and explore local cafes"
        ]
      },
      {
        "day": 4,
        "location": "Prague",
        "activities": [
          "Free time for additional sightseeing or shopping",
          "Lunch in Prague",
          "Transfer to the airport for departure"
        ]
      }
    ]
  }
  