{
    "package_name": "San Francisco Discovery",
    "country": "USA",
    "duration_days": 4,
    "customer_rating": 4.7,
    "places_to_visit": [
      {
        "name": "Golden Gate Bridge",
        "description": "The Golden Gate Bridge is an iconic suspension bridge that connects San Francisco to Marin County. It's known for its stunning architecture and offers breathtaking views of the bay and city skyline."
      },
      {
        "name": "Alcatraz Island",
        "description": "Alcatraz Island is home to the infamous former prison that housed some of America's most notorious criminals. Tours of the island provide insight into its history and offer spectacular views of San Francisco Bay."
      },
      {
        "name": "Fisherman's Wharf",
        "description": "Fisherman's Wharf is a bustling waterfront area known for its seafood restaurants, shops, and attractions. Key spots include Pier 39, home to a colony of sea lions, and the Aquarium of the Bay."
      },
      {
        "name": "Chinatown",
        "description": "San Francisco's Chinatown is the oldest and one of the largest in North America. It features vibrant street markets, traditional Chinese architecture, and authentic restaurants."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "San Francisco",
        "hotels": ["The Ritz-Carlton", "Fairmont San Francisco", "Hotel Nikko San Francisco"],
        "restaurants": ["Swan Oyster Depot", "House of Nanking", "Gary Danko"]
      }
    ],
    "activities": [
      "Walk or bike across the Golden Gate Bridge",
      "Take a ferry to Alcatraz Island and tour the former prison",
      "Explore Fisherman's Wharf and enjoy local seafood",
      "Wander through Chinatown and sample authentic Chinese cuisine"
    ],
    "tips_and_tricks": [
      "Dress in layers as San Francisco weather can be unpredictable.",
      "Book Alcatraz tickets well in advance to secure a spot.",
      "Try the clam chowder served in a sourdough bread bowl at Fisherman's Wharf."
    ],
    "emergency_contacts": {
      "tour_guide": "+1 415-555-6789",
      "local_police": "911",
      "embassy": "+1 415-555-2345"
    },
    "timeline": [
      {
        "day": 1,
        "location": "San Francisco",
        "activities": [
          "Arrival at San Francisco International Airport and transfer to the hotel",
          "Briefing on the tour and rest",
          "Dinner at a local restaurant and overnight stay"
        ]
      },
      {
        "day": 2,
        "location": "San Francisco",
        "activities": [
          "Walk or bike across the Golden Gate Bridge in the morning",
          "Lunch at a nearby café",
          "Afternoon visit to Fisherman's Wharf and Pier 39",
          "Dinner and overnight stay at the hotel"
        ]
      },
      {
        "day": 3,
        "location": "San Francisco",
        "activities": [
          "Ferry to Alcatraz Island for a tour",
          "Lunch on the island or back in San Francisco",
          "Explore Chinatown in the afternoon",
          "Dinner at a local restaurant and overnight stay"
        ]
      },
      {
        "day": 4,
        "location": "Departure",
        "activities": [
          "Check-out from the hotel and transfer to the airport for departure"
        ]
      }
    ]
  }
  