{
    "package_name": "Timbuktu Treasures",
    "country": "Mali",
    "duration_days": 5,
    "customer_rating": 4.7,
    "places_to_visit": [
      {
        "name": "Timbuktu",
        "description": "Timbuktu is an ancient city located in the Sahara Desert, known for its historical role as a center of trade and Islamic scholarship. Key sites include the Djinguereber Mosque, the Sankore University, and the historic manuscripts housed in local libraries."
      },
      {
        "name": "Bamako",
        "description": "Bamako is the capital of Mali and a vibrant city with attractions such as the National Museum of Mali, the Grand Mosque, and local markets."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Timbuktu",
        "hotels": ["Hotel La Maison des Ambassadeurs", "Auberge Grand Hotel"],
        "restaurants": ["La Maison des Ambassadeurs Restaurant", "Le Relais des Voyageurs"]
      }
    ],
    "activities": [
      "Explore the historic sites of Timbuktu, including the Djinguereber Mosque and Sankore University",
      "Visit local libraries to see ancient manuscripts",
      "Explore Bamako's museums and markets"
    ],
    "tips_and_tricks": [
      "Ensure you have the necessary visas and permits for travel in Mali.",
      "Travel with a guide due to the remote and historic nature of Timbuktu.",
      "Check travel advisories before planning your visit."
    ],
    "emergency_contacts": {
      "tour_guide": "+223 20-555-1234",
      "local_police": "17",
      "embassy": "+223 20-555-5678"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Bamako",
        "activities": [
          "Arrival at Bamako-Sénou International Airport and transfer to Timbuktu",
          "Briefing on the tour and rest",
          "Dinner at a local restaurant and overnight stay"
        ]
      },
      {
        "day": 2,
        "location": "Timbuktu",
        "activities": [
          "Explore the Djinguereber Mosque and Sankore University",
          "Lunch at a local restaurant",
          "Visit historic manuscript libraries in the afternoon",
          "Dinner and overnight stay at the hotel"
        ]
      },
      {
        "day": 3,
        "location": "Timbuktu",
        "activities": [
          "Full-day exploration of Timbuktu, including local markets and cultural sites",
          "Lunch at a local café",
          "Dinner and overnight stay"
        ]
      },
      {
        "day": 4,
        "location": "Bamako",
        "activities": [
          "Travel back to Bamako",
          "Visit the National Museum of Mali and other key sites",
          "Lunch in Bamako",
          "Free time for shopping or additional sightseeing",
          "Dinner and overnight stay"
        ]
      },
      {
        "day": 5,
        "location": "Departure",
        "activities": [
          "Check-out from the hotel and transfer to the airport for departure"
        ]
      }
    ]
  }
  