{
    "package_name": "Toronto City Experience",
    "country": "Canada",
    "duration_days": 4,
    "customer_rating": 4.6,
    "places_to_visit": [
      {
        "name": "CN Tower",
        "description": "The CN Tower is a landmark observation tower offering stunning views of Toronto from its observation decks. The EdgeWalk, a thrilling outdoor walk around the tower's edge, provides an adrenaline-pumping experience."
      },
      {
        "name": "Royal Ontario Museum",
        "description": "The Royal Ontario Museum is one of the largest museums in North America, featuring extensive exhibits on art, culture, and natural history. Its architecture combines historic and modern elements, making it a visual delight."
      },
      {
        "name": "Toronto Islands",
        "description": "The Toronto Islands are a group of small islands located just off the coast of downtown Toronto. They offer beautiful beaches, picnic areas, and bike rentals, making them a great spot for a relaxing day out."
      },
      {
        "name": "Distillery District",
        "description": "The Distillery District is a historic area known for its well-preserved Victorian buildings, art galleries, boutiques, and craft breweries. It's a popular destination for strolling, shopping, and dining."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Toronto",
        "hotels": ["The Ritz-Carlton Toronto", "Four Seasons Hotel Toronto", "The Fairmont Royal York"],
        "restaurants": ["Alo Restaurant", "Buca", "Canoe Restaurant"]
      }
    ],
    "activities": [
      "Visit the CN Tower and experience the observation decks",
      "Explore the Royal Ontario Museum's exhibits",
      "Take a ferry to the Toronto Islands and enjoy the outdoor activities",
      "Wander through the Distillery District and enjoy local shops and dining"
    ],
    "tips_and_tricks": [
      "Check the weather before visiting the CN Tower for clear views.",
      "Consider purchasing a City Pass for discounted entry to multiple attractions.",
      "Wear comfortable shoes for exploring the city's diverse neighborhoods."
    ],
    "emergency_contacts": {
      "tour_guide": "+1 416-555-1234",
      "local_police": "911",
      "embassy": "+1 416-555-5678"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Toronto",
        "activities": [
          "Arrival at Toronto Pearson International Airport and transfer to the hotel",
          "Briefing on the tour and rest",
          "Dinner at a local restaurant and overnight stay"
        ]
      },
      {
        "day": 2,
        "location": "Toronto",
        "activities": [
          "Visit the CN Tower and EdgeWalk in the morning",
          "Lunch at a nearby restaurant",
          "Afternoon visit to the Royal Ontario Museum",
          "Dinner and overnight stay at the hotel"
        ]
      },
      {
        "day": 3,
        "location": "Toronto",
        "activities": [
          "Take a ferry to the Toronto Islands and spend the day exploring",
          "Lunch on the islands or back in the city",
          "Return to the city and visit the Distillery District in the evening",
          "Dinner at a restaurant in the Distillery District and overnight stay"
        ]
      },
      {
        "day": 4,
        "location": "Departure",
        "activities": [
          "Check-out from the hotel and transfer to the airport for departure"
        ]
      }
    ]
  }
  