{
    "package_name": "Vancouver Exploration",
    "country": "Canada",
    "duration_days": 5,
    "customer_rating": 4.7,
    "places_to_visit": [
      {
        "name": "Stanley Park",
        "description": "Stanley Park is a large urban park offering scenic views, walking and biking trails, and attractions like the Vancouver Aquarium. The park's seawall provides a stunning waterfront experience."
      },
      {
        "name": "Granville Island",
        "description": "Granville Island is a vibrant cultural district known for its public market, artisan shops, and theaters. It’s a great place to sample local food, shop for unique crafts, and enjoy street performances."
      },
      {
        "name": "Capilano Suspension Bridge",
        "description": "The Capilano Suspension Bridge is a thrilling experience that spans a deep gorge. The bridge, along with the treetop walkways and the Cliffwalk, offers stunning views of the surrounding forest."
      },
      {
        "name": "Grouse Mountain",
        "description": "Grouse Mountain provides outdoor activities year-round, including hiking, skiing, and zip-lining. The Grouse Skyride offers panoramic views of Vancouver and the surrounding mountains."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Vancouver",
        "hotels": ["The Fairmont Waterfront", "The St. Regis Hotel", "Rosewood Hotel Georgia"],
        "restaurants": ["Blue Water Cafe", "Miku", "Hawksworth Restaurant"]
      }
    ],
    "activities": [
      "Explore Stanley Park and its various attractions",
      "Visit Granville Island and enjoy its public market",
      "Experience the Capilano Suspension Bridge and treetop walkways",
      "Take the Grouse Skyride and explore Grouse Mountain"
    ],
    "tips_and_tricks": [
      "Bring layers as the weather can change quickly.",
      "Purchase tickets for popular attractions in advance.",
      "Take advantage of Vancouver's public transportation system for easy travel."
    ],
    "emergency_contacts": {
      "tour_guide": "+1 604-555-1234",
      "local_police": "911",
      "embassy": "+1 604-555-5678"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Vancouver",
        "activities": [
          "Arrival at Vancouver International Airport and transfer to the hotel",
          "Briefing on the tour and rest",
          "Dinner at a local restaurant and overnight stay"
        ]
      },
      {
        "day": 2,
        "location": "Vancouver",
        "activities": [
          "Explore Stanley Park and its attractions in the morning",
          "Lunch at a park café",
          "Afternoon visit to Granville Island",
          "Dinner and overnight stay at the hotel"
        ]
      },
      {
        "day": 3,
        "location": "Vancouver",
        "activities": [
          "Visit the Capilano Suspension Bridge in the morning",
          "Lunch at a nearby restaurant",
          "Explore the surrounding area or enjoy free time in Vancouver",
          "Dinner and overnight stay"
        ]
      },
      {
        "day": 4,
        "location": "Vancouver",
        "activities": [
          "Take the Grouse Skyride and explore Grouse Mountain",
          "Lunch at a mountaintop café",
          "Afternoon free for additional sightseeing or shopping",
          "Dinner at a top-rated restaurant and overnight stay"
        ]
      },
      {
        "day": 5,
        "location": "Departure",
        "activities": [
          "Check-out from the hotel and transfer to the airport for departure"
        ]
      }
    ]
  }
  