{
    "package_name": "Varanasi Spiritual Experience",
    "country": "India",
    "duration_days": 4,
    "customer_rating": 4.7,
    "places_to_visit": [
      {
        "name": "Kashi Vishwanath Temple",
        "description": "The Kashi Vishwanath Temple is one of the most sacred Hindu temples dedicated to Lord Shiva. It is a major pilgrimage site and is located on the banks of the Ganges River."
      },
      {
        "name": "Sarnath",
        "description": "Sarnath is an important Buddhist site where Lord Buddha gave his first sermon. It features ancient ruins, stupas, and the Sarnath Archaeological Museum."
      },
      {
        "name": "Dashashwamedh Ghat",
        "description": "Dashashwamedh Ghat is one of the most famous ghats in Varanasi. It is known for its evening Aarti ceremony, which is a spectacular ritual of worship with fire lamps."
      },
      {
        "name": "Manikarnika Ghat",
        "description": "Manikarnika Ghat is one of the oldest and most sacred ghats, primarily associated with Hindu cremation rituals. It’s a significant site for understanding local customs and traditions."
      },
      {
        "name": "Ramnagar Fort",
        "description": "Ramnagar Fort is a historic fort located on the banks of the Ganges River. It offers insight into the local royal history and architecture."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Varanasi",
        "hotels": ["The Gateway Hotel Ganges", "Brijrama Palace", "Hotel Surya"],
        "restaurants": ["Kashi Chaat Bhandar", "Dosa Plaza", "Brown Bread Bakery"]
      }
    ],
    "activities": [
      "Visit the Kashi Vishwanath Temple",
      "Explore the ancient ruins and museum at Sarnath",
      "Witness the Aarti ceremony at Dashashwamedh Ghat",
      "Learn about local customs at Manikarnika Ghat",
      "Explore the Ramnagar Fort"
    ],
    "tips_and_tricks": [
      "Wear comfortable and respectful clothing for temple visits.",
      "Carry bottled water and snacks during sightseeing.",
      "Be prepared for crowds, especially at ghats and temples."
    ],
    "emergency_contacts": {
      "tour_guide": "+91 542-555-1234",
      "local_police": "100",
      "embassy": "+91 542-555-5678"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Varanasi",
        "activities": [
          "Arrival at Lal Bahadur Shastri Airport and transfer to the hotel",
          "Briefing on the tour and rest",
          "Dinner at a local restaurant and overnight stay"
        ]
      },
      {
        "day": 2,
        "location": "Varanasi",
        "activities": [
          "Visit the Kashi Vishwanath Temple in the morning",
          "Lunch at a local restaurant",
          "Explore Dashashwamedh Ghat and witness the Aarti ceremony in the evening",
          "Dinner and overnight stay"
        ]
      },
      {
        "day": 3,
        "location": "Varanasi",
        "activities": [
          "Explore Sarnath and its archaeological sites in the morning",
          "Lunch at a local restaurant",
          "Visit Manikarnika Ghat and Ramnagar Fort in the afternoon",
          "Dinner and overnight stay"
        ]
      },
      {
        "day": 4,
        "location": "Varanasi",
        "activities": [
          "Final free time for shopping or additional sightseeing",
          "Lunch at the hotel or nearby restaurant",
          "Transfer to Lal Bahadur Shastri Airport for departure"
        ]
      }
    ]
  }
  