{
    "package_name": "The Smoke that Thunders: Victoria Falls Adventure",
    "country": "Zambia/Zimbabwe",
    "duration_days": 5,
    "customer_rating": 4.7,
    "places_to_visit": [
      {
        "name": "Victoria Falls",
        "description": "Victoria Falls is one of the largest and most famous waterfalls in the world, located on the border between Zambia and Zimbabwe. Known locally as 'Mosi-oa-Tunya' or 'The Smoke that Thunders', the falls are over 1.7 kilometers wide and drop approximately 108 meters into the Zambezi Gorge. The falls are a UNESCO World Heritage site and are renowned for their breathtaking views, powerful cascades, and the mist that rises from the crashing waters."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Livingstone (Zambia)",
        "hotels": ["Royal Livingstone Hotel", "Avani Victoria Falls Resort", "Maramba River Lodge"],
        "restaurants": ["The Golden Leaf", "Cafe Zambezi", "Olga's Italian Corner"]
      },
      {
        "location": "Victoria Falls Town (Zimbabwe)",
        "hotels": ["Victoria Falls Hotel", "The Elephant Camp", "Ilala Lodge"],
        "restaurants": ["The Boma - Dinner & Drum Show", "The Lookout Café", "Three Monkeys Restaurant"]
      }
    ],
    "activities": [
      "Viewing Victoria Falls from both Zambia and Zimbabwe",
      "Helicopter flight over the falls",
      "Sunset cruise on the Zambezi River",
      "White-water rafting in the Zambezi Gorge",
      "Bungee jumping from the Victoria Falls Bridge"
    ],
    "tips_and_tricks": [
      "Visit during the dry season (May to October) for clear views of the falls.",
      "Wear waterproof clothing or bring a raincoat when visiting close to the falls.",
      "Carry cash in small denominations for local markets and tips."
    ],
    "emergency_contacts": {
      "tour_guide": "+260 978 123 456 (Zambia), +263 71 234 5678 (Zimbabwe)",
      "local_police": "999 (Zambia), 999 (Zimbabwe)",
      "embassy": "+260 211 250 780 (Zambia), +263 4 252 181 (Zimbabwe)"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Livingstone (Zambia)",
        "activities": [
          "Arrival at Harry Mwanga Nkumbula International Airport and transfer to the hotel",
          "Afternoon visit to the Zambian side of Victoria Falls",
          "Sunset cruise on the Zambezi River with drinks and snacks",
          "Dinner at the hotel and overnight stay"
        ]
      },
      {
        "day": 2,
        "location": "Victoria Falls (Zimbabwe)",
        "activities": [
          "Cross the border to Zimbabwe and visit the falls from the Zimbabwean side",
          "Explore the rainforest trails around the falls",
          "Lunch at The Lookout Café, offering stunning views of the gorge",
          "Afternoon helicopter flight over Victoria Falls",
          "Dinner at The Boma with traditional dance and drumming entertainment"
        ]
      },
      {
        "day": 3,
        "location": "Victoria Falls (Zimbabwe)",
        "activities": [
          "Morning white-water rafting in the Zambezi Gorge",
          "Lunch at a local restaurant in Victoria Falls Town",
          "Visit the Victoria Falls Bridge for a bungee jumping experience",
          "Free time to explore the town or visit the Victoria Falls Hotel",
          "Dinner and overnight stay at the hotel"
        ]
      },
      {
        "day": 4,
        "location": "Livingstone (Zambia)",
        "activities": [
          "Return to Zambia and visit the Livingstone Museum",
          "Explore the Mukuni Village for cultural insights",
          "Lunch at Café Zambezi",
          "Afternoon visit to a local craft market",
          "Dinner and overnight stay at the hotel"
        ]
      },
      {
        "day": 5,
        "location": "Livingstone (Zambia)",
        "activities": [
          "Check-out from the hotel and transfer to the airport for departure"
        ]
      }
    ]
  }
  