{
    "package_name": "Amazon Rainforest Expedition",
    "country": "Brazil",
    "duration_days": 6,
    "customer_rating": 4.7,
    "tour_cost_usd": 1500,
    "region_description": "The Amazon Rainforest, often referred to as the 'lungs of the Earth,' is the largest tropical rainforest in the world, renowned for its incredible biodiversity and ecological importance. This vast and vibrant ecosystem is home to countless species of flora and fauna, many of which are not found anywhere else on the planet. Visitors to the Amazon can experience the unique wildlife, indigenous cultures, and breathtaking landscapes, while participating in activities such as canoeing, hiking, and birdwatching. Exploring the Amazon is an adventure that immerses travelers in one of the most diverse ecosystems on Earth.",
    "places_to_visit": [
      {
        "name": "Manaus",
        "description": "The capital of the Amazon, Manaus is a vibrant city known for its rich history and as the gateway to the rainforest."
      },
      {
        "name": "Anavilhanas National Park",
        "description": "This national park features stunning river archipelagos and diverse wildlife, ideal for exploring the Amazon River's beauty."
      },
      {
        "name": "Jaú National Park",
        "description": "One of the largest national parks in Brazil, known for its pristine rainforests and rich biodiversity."
      },
      {
        "name": "Meeting of the Waters",
        "description": "A natural phenomenon where the dark waters of the Rio Negro meet the sandy waters of the Amazon River without mixing."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Manaus",
        "hotels": [
          {
            "name": "Tropical Manaus Ecoresort",
            "description": "A luxurious resort surrounded by the Amazon rainforest, offering comfortable accommodations and a range of amenities.",
            "cost_per_night_usd": 250
          },
          {
            "name": "Amazon Eco Lodge",
            "description": "A cozy lodge that provides eco-friendly accommodations and guided tours of the rainforest.",
            "cost_per_night_usd": 100
          }
        ],
        "restaurants": [
          {
            "name": "Banana Brasil",
            "description": "A local restaurant offering traditional Amazonian dishes with fresh ingredients sourced from the rainforest.",
            "average_cost_per_person_usd": 20
          },
          {
            "name": "Canto da Selva",
            "description": "A charming eatery known for its delicious regional cuisine and welcoming atmosphere.",
            "average_cost_per_person_usd": 30
          }
        ]
      }
    ],
    "activities": [
      "Explore the Amazon rainforest with guided tours.",
      "Canoe along the river and spot wildlife.",
      "Visit indigenous communities and learn about their culture.",
      "Experience the Meeting of the Waters."
    ],
    "tips_and_tricks": [
      "Pack lightweight, breathable clothing for the rainforest.",
      "Bring insect repellent and sunscreen.",
      "Stay hydrated and be prepared for sudden rain showers."
    ],
    "emergency_contacts": {
      "tour_guide": "+55 92 123 4567",
      "local_police": "190",
      "embassy": "+55 92 555 5555"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Manaus",
        "activities": [
          "Arrival in Manaus and transfer to the hotel.",
          "Briefing on the tour and relax.",
          "Dinner at Canto da Selva."
        ]
      },
      {
        "day": 2,
        "location": "Anavilhanas National Park",
        "activities": [
          "Full day tour to Anavilhanas National Park, including wildlife spotting and canoeing.",
          "Lunch in the park.",
          "Return to Manaus for dinner."
        ]
      },
      {
        "day": 3,
        "location": "Jaú National Park",
        "activities": [
          "Day trip to Jaú National Park for hiking and exploring.",
          "Lunch in the park.",
          "Return to Manaus for dinner."
        ]
      },
      {
        "day": 4,
        "location": "Meeting of the Waters",
        "activities": [
          "Visit the Meeting of the Waters and learn about the unique natural phenomenon.",
          "Lunch on the riverbank.",
          "Return to Manaus for dinner."
        ]
      },
      {
        "day": 5,
        "location": "Manaus",
        "activities": [
          "Free day for optional activities such as visiting local markets or museums.",
          "Lunch at Banana Brasil.",
          "Dinner at the hotel."
        ]
      },
      {
        "day": 6,
        "location": "Departure",
        "activities": [
          "Check-out from the hotel and transfer to the airport for departure."
        ]
      }
    ],
    "customer_reviews": [
      {
        "name": "Sophia G.",
        "rating": 5.0,
        "description": "An unforgettable experience in the Amazon! The wildlife and scenery were breathtaking."
      },
      {
        "name": "Liam W.",
        "rating": 4.7,
        "description": "The guided tours were informative and the accommodations were fantastic!"
      }
    ]
  }
  