{
    "package_name": "Andaman Bliss Tour",
    "country": "India",
    "region": "Andaman and Nicobar Islands",
    "duration_days": 6,
    "customer_rating": 4.8,
    "tour_cost_usd": 1800,
    "region_description": "The Andaman and Nicobar Islands are a stunning archipelago located in the Bay of Bengal, known for their pristine beaches, turquoise waters, and vibrant coral reefs. With a rich cultural heritage and diverse ecosystems, these islands offer a perfect blend of relaxation and adventure. Popular activities include snorkeling, scuba diving, and exploring uninhabited islands. The capital city, Port Blair, serves as the gateway to these islands and is home to historical sites like the Cellular Jail, which played a significant role in India's struggle for independence. The natural beauty and unique wildlife make the Andaman and Nicobar Islands a paradise for nature lovers and adventure enthusiasts alike.",
    "places_to_visit": [
      {
        "name": "Port Blair",
        "description": "Port Blair is the capital of the Andaman and Nicobar Islands and serves as the main entry point for visitors. It is known for its historical significance, especially the Cellular Jail, which stands as a testament to India’s struggle for freedom. The city also features beautiful beaches, museums, and vibrant markets."
      },
      {
        "name": "Havelock Island",
        "description": "Havelock Island is famous for its stunning beaches, particularly Radhanagar Beach, which has been rated among the best beaches in Asia. The island offers a range of water sports, including snorkeling and scuba diving, along with lush green forests and a relaxed atmosphere."
      },
      {
        "name": "Neil Island",
        "description": "Neil Island is known for its serene beaches, coral reefs, and natural beauty. The island is a great spot for snorkeling, swimming, and exploring the rich marine life. Popular beaches include Bharatpur Beach and Laxmanpur Beach, both offering tranquil surroundings and picturesque views."
      },
      {
        "name": "Ross Island",
        "description": "Ross Island is a small island near Port Blair that was once the administrative headquarters of the British during their rule. Today, it is known for its ruins, including colonial buildings and the remnants of a church. The island is a peaceful getaway with beautiful views of the sea."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Andaman and Nicobar Islands",
        "hotels": [
          {
            "name": "SeaShell Havelock",
            "description": "SeaShell Havelock is a luxury resort located near Radhanagar Beach. It offers spacious accommodations, a private beach, and a range of recreational activities, ensuring a relaxing stay amidst nature.",
            "cost_per_night_usd": 200
          },
          {
            "name": "Hotel Haywizz, Port Blair",
            "description": "Hotel Haywizz is a comfortable hotel in Port Blair offering modern amenities and easy access to the city’s attractions. Guests can enjoy a restaurant, spa services, and well-appointed rooms.",
            "cost_per_night_usd": 100
          },
          {
            "name": "Silver Sand Beach Resort, Neil Island",
            "description": "Silver Sand Beach Resort is a beachfront property on Neil Island. It features cozy cottages, a restaurant with local cuisine, and easy access to nearby beaches, perfect for a relaxing getaway.",
            "cost_per_night_usd": 150
          }
        ],
        "restaurants": [
          {
            "name": "Ananda Restaurant, Port Blair",
            "description": "Ananda Restaurant is known for its fresh seafood and local delicacies. The casual ambiance and delicious menu make it a popular dining spot for both locals and tourists.",
            "average_cost_per_person_usd": 15
          },
          {
            "name": "The Red Snapper, Havelock Island",
            "description": "The Red Snapper offers a delightful dining experience with a focus on fresh seafood and international cuisine. Guests can enjoy their meals while overlooking the beautiful beach.",
            "average_cost_per_person_usd": 20
          },
          {
            "name": "Garden Restaurant, Neil Island",
            "description": "Garden Restaurant is a cozy eatery in Neil Island known for its laid-back atmosphere and delicious local dishes. It’s a great spot to enjoy a meal after a day of exploring.",
            "average_cost_per_person_usd": 10
          }
        ]
      }
    ],
    "activities": [
      "Relax on the pristine beaches of Havelock and Neil Island.",
      "Go snorkeling or scuba diving to explore the vibrant marine life.",
      "Visit the historical Cellular Jail and learn about its significance.",
      "Take a day trip to Ross Island and explore its colonial ruins.",
      "Enjoy water sports like jet skiing and banana boat rides."
    ],
    "tips_and_tricks": [
      "Book your ferry tickets in advance to avoid last-minute hassles.",
      "Carry cash, as not all places accept credit cards.",
      "Use biodegradable sunscreen to protect the fragile marine ecosystem."
    ],
    "emergency_contacts": {
      "tour_guide": "+91 123 456 7890",
      "local_police": "100",
      "embassy": "+91 11 2419 1000"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Port Blair",
        "activities": [
          "Arrival at Port Blair Airport and transfer to the hotel.",
          "Briefing on the tour and overview of the Andaman Islands.",
          "Visit the Cellular Jail and watch the light and sound show in the evening.",
          "Dinner at Ananda Restaurant, enjoying local seafood."
        ]
      },
      {
        "day": 2,
        "location": "Havelock Island",
        "activities": [
          "Take a morning ferry to Havelock Island and check into the hotel.",
          "Visit Radhanagar Beach, relaxing and swimming in its pristine waters.",
          "Lunch at The Red Snapper, overlooking the beach.",
          "Enjoy water sports like snorkeling or scuba diving in the afternoon."
        ]
      },
      {
        "day": 3,
        "location": "Havelock Island",
        "activities": [
          "Explore Elephant Beach, known for its coral reefs and water sports.",
          "Lunch at a beachside café, enjoying fresh seafood.",
          "Afternoon at leisure for beach activities or relaxation.",
          "Dinner at the hotel, savoring local and international dishes."
        ]
      },
      {
        "day": 4,
        "location": "Neil Island",
        "activities": [
          "Take a morning ferry to Neil Island and check into the hotel.",
          "Visit Bharatpur Beach for swimming and relaxation.",
          "Lunch at Garden Restaurant, enjoying local cuisine.",
          "Explore Laxmanpur Beach and witness the stunning sunset."
        ]
      },
      {
        "day": 5,
        "location": "Port Blair",
        "activities": [
          "Take a ferry back to Port Blair.",
          "Visit Ross Island and explore its historical ruins.",
          "Lunch at a local restaurant in Port Blair.",
          "Afternoon at leisure for shopping or relaxation.",
          "Dinner at the hotel or nearby restaurant."
        ]
      },
      {
        "day": 6,
        "location": "Departure",
        "activities": [
          "Check-out from the hotel and transfer to Port Blair Airport for departure."
        ]
      }
    ],
    "customer_reviews": [
      {
        "name": "Anjali R.",
        "rating": 5,
        "description": "Andaman is a dream destination! The beaches were stunning, and the activities were amazing!"
      },
      {
        "name": "Rajesh M.",
        "rating": 4.9,
        "description": "An unforgettable experience! The snorkeling in Havelock was the highlight of the trip."
      },
      {
        "name": "Sonia P.",
        "rating": 4.8,
        "description": "A perfect getaway! The beauty of Neil Island and the hospitality made it special."
      }
    ]
  }
  