{
    "package_name": "Banff National Park Adventure",
    "country": "Canada",
    "duration_days": 5,
    "customer_rating": 4.8,
    "tour_cost_usd": 1300,
    "region_description": "Banff National Park, located in the heart of the Canadian Rockies, is a stunning natural wonder known for its breathtaking landscapes, diverse wildlife, and outdoor recreational opportunities. Established in 1885, Banff is Canada’s first national park and features majestic mountains, crystal-clear lakes, and lush forests. Visitors can explore scenic hiking trails, indulge in skiing during winter months, and relax in natural hot springs. The charming town of Banff offers a vibrant atmosphere with a range of dining, shopping, and cultural experiences, making it a perfect getaway for nature lovers and adventure seekers.",
    "places_to_visit": [
      {
        "name": "Lake Louise",
        "description": "Famous for its turquoise waters and surrounded by towering mountains, Lake Louise is a must-visit for hiking, canoeing, and photography."
      },
      {
        "name": "Moraine Lake",
        "description": "Known for its striking blue color, Moraine Lake offers stunning views and excellent hiking trails amidst the breathtaking scenery of the Valley of the Ten Peaks."
      },
      {
        "name": "Banff Town",
        "description": "A charming resort town with a vibrant cultural scene, shops, restaurants, and stunning views of the surrounding mountains."
      },
      {
        "name": "Sulphur Mountain",
        "description": "Accessible by gondola, Sulphur Mountain provides panoramic views of the Rockies and the opportunity to hike along the boardwalk to the summit."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Banff",
        "hotels": [
          {
            "name": "Fairmont Banff Springs",
            "description": "A luxurious castle-like hotel set against the stunning backdrop of the Rockies, offering elegant accommodations and a world-class spa.",
            "cost_per_night_usd": 500
          },
          {
            "name": "Banff Rocky Mountain Resort",
            "description": "A comfortable and family-friendly resort with modern amenities, ideal for those seeking adventure and relaxation.",
            "cost_per_night_usd": 250
          }
        ],
        "restaurants": [
          {
            "name": "The Bison Restaurant",
            "description": "Known for its farm-to-table cuisine, this restaurant offers a menu featuring local ingredients and a cozy atmosphere.",
            "average_cost_per_person_usd": 60
          },
          {
            "name": "Park Distillery",
            "description": "A unique restaurant and distillery offering Canadian comfort food and craft spirits, with a rustic yet modern ambiance.",
            "average_cost_per_person_usd": 30
          }
        ]
      }
    ],
    "activities": [
      "Hike around the picturesque Lake Louise.",
      "Visit Moraine Lake for breathtaking views.",
      "Explore the town of Banff and its local shops.",
      "Ride the gondola to Sulphur Mountain for panoramic views."
    ],
    "tips_and_tricks": [
      "Dress in layers, as mountain weather can change quickly.",
      "Book accommodations and activities in advance, especially in peak season.",
      "Stay hydrated and carry snacks while hiking."
    ],
    "emergency_contacts": {
      "tour_guide": "+1 403 123 4567",
      "local_police": "911",
      "embassy": "+1 613 555 0123"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Banff",
        "activities": [
          "Arrival in Banff and transfer to the hotel.",
          "Briefing on the tour and relax.",
          "Dinner at Park Distillery."
        ]
      },
      {
        "day": 2,
        "location": "Lake Louise",
        "activities": [
          "Day trip to Lake Louise for hiking and exploration.",
          "Lunch at a lakeside café.",
          "Return to Banff for dinner at The Bison Restaurant."
        ]
      },
      {
        "day": 3,
        "location": "Moraine Lake",
        "activities": [
          "Morning visit to Moraine Lake for stunning views and hiking.",
          "Picnic lunch by the lake.",
          "Afternoon relaxation or additional hiking.",
          "Dinner at a local restaurant."
        ]
      },
      {
        "day": 4,
        "location": "Banff Town",
        "activities": [
          "Explore the town of Banff, visiting shops and galleries.",
          "Lunch at a local café.",
          "Afternoon at leisure or visit Banff Upper Hot Springs.",
          "Dinner at the hotel."
        ]
      },
      {
        "day": 5,
        "location": "Sulphur Mountain",
        "activities": [
          "Gondola ride to Sulphur Mountain for panoramic views.",
          "Hike along the boardwalk to the summit.",
          "Lunch at a café on the mountain.",
          "Return to Banff for dinner."
        ]
      },
      {
        "day": 6,
        "location": "Departure",
        "activities": [
          "Check-out from the hotel and transfer to the airport for departure."
        ]
      }
    ],
    "customer_reviews": [
      {
        "name": "Emma L.",
        "rating": 5.0,
        "description": "Banff is absolutely breathtaking! The scenery and activities were unforgettable."
      },
      {
        "name": "Noah P.",
        "rating": 4.7,
        "description": "Loved exploring Lake Louise and Moraine Lake. A fantastic experience!"
      }
    ]
  }
  