{
    "package_name": "Cancun Beach Getaway",
    "country": "Mexico",
    "duration_days": 5,
    "customer_rating": 4.7,
    "tour_cost_usd": 1500,
    "region_description": "Cancun, located on the northeast coast of the Yucatan Peninsula, is a world-renowned tourist destination famous for its stunning beaches, vibrant nightlife, and rich Mayan culture. This tropical paradise boasts beautiful turquoise waters, luxurious resorts, and a variety of recreational activities. Cancun is not only a gateway to ancient Mayan ruins but also offers opportunities for water sports, eco-tourism, and exploring nearby natural wonders such as cenotes and coral reefs. The blend of natural beauty and cultural heritage makes Cancun a must-visit for beach lovers and history enthusiasts alike.",
    "places_to_visit": [
      {
        "name": "Chichen Itza",
        "description": "One of the New Seven Wonders of the World, this ancient Mayan city features the iconic El Castillo pyramid and offers insight into the Mayan civilization."
      },
      {
        "name": "Tulum",
        "description": "A stunning coastal archaeological site that overlooks the Caribbean Sea, known for its well-preserved ruins and breathtaking views."
      },
      {
        "name": "Isla Mujeres",
        "description": "A small island just off the coast of Cancun, famous for its beautiful beaches, snorkeling opportunities, and vibrant local culture."
      },
      {
        "name": "Xcaret Park",
        "description": "An eco-archaeological park that combines natural beauty, cultural performances, and adventure activities, providing a unique experience for visitors."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Cancun",
        "hotels": [
          {
            "name": "The Ritz-Carlton Cancun",
            "description": "A luxurious beachfront resort offering elegant rooms, gourmet dining, and a world-class spa.",
            "cost_per_night_usd": 600
          },
          {
            "name": "Moon Palace Cancun",
            "description": "An all-inclusive resort featuring spacious accommodations, multiple restaurants, and entertainment options for families and couples.",
            "cost_per_night_usd": 350
          }
        ],
        "restaurants": [
          {
            "name": "La Habichuela",
            "description": "An award-winning restaurant known for its exquisite seafood dishes and charming ambiance, offering a taste of traditional Mexican cuisine.",
            "average_cost_per_person_usd": 70
          },
          {
            "name": "El Fish Fritanga",
            "description": "A casual dining spot famous for its fresh seafood and relaxed atmosphere, perfect for enjoying a meal by the beach.",
            "average_cost_per_person_usd": 25
          }
        ]
      }
    ],
    "activities": [
      "Visit the ancient ruins of Chichen Itza.",
      "Explore the coastal ruins at Tulum.",
      "Take a ferry to Isla Mujeres for a day of relaxation.",
      "Enjoy adventure activities at Xcaret Park."
    ],
    "tips_and_tricks": [
      "Stay hydrated and use sunscreen while enjoying the beach.",
      "Book tours in advance to secure your spot.",
      "Try local street food for an authentic culinary experience."
    ],
    "emergency_contacts": {
      "tour_guide": "+52 998 123 4567",
      "local_police": "911",
      "embassy": "+52 555 123 4567"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Cancun",
        "activities": [
          "Arrival in Cancun and transfer to the hotel.",
          "Briefing on the tour and relax.",
          "Dinner at El Fish Fritanga."
        ]
      },
      {
        "day": 2,
        "location": "Chichen Itza",
        "activities": [
          "Day trip to Chichen Itza to explore the ancient ruins.",
          "Lunch at a local restaurant near the site.",
          "Return to Cancun for dinner at the hotel."
        ]
      },
      {
        "day": 3,
        "location": "Tulum",
        "activities": [
          "Morning visit to Tulum for a guided tour of the archaeological site.",
          "Lunch at a beachside café.",
          "Afternoon relaxation on Tulum's beautiful beaches.",
          "Dinner at La Habichuela."
        ]
      },
      {
        "day": 4,
        "location": "Isla Mujeres",
        "activities": [
          "Ferry ride to Isla Mujeres for a day of sun and relaxation.",
          "Lunch at a beach restaurant.",
          "Snorkeling or lounging on the beach.",
          "Return to Cancun for dinner."
        ]
      },
      {
        "day": 5,
        "location": "Xcaret Park",
        "activities": [
          "Full day at Xcaret Park to enjoy various activities and cultural performances.",
          "Lunch within the park.",
          "Return to the hotel for dinner."
        ]
      },
      {
        "day": 6,
        "location": "Departure",
        "activities": [
          "Check-out from the hotel and transfer to the airport for departure."
        ]
      }
    ],
    "customer_reviews": [
      {
        "name": "Lucas A.",
        "rating": 5.0,
        "description": "The Cancun trip was amazing! Chichen Itza was a highlight, and the beaches were beautiful."
      },
      {
        "name": "Mia T.",
        "rating": 4.8,
        "description": "Loved every moment in Cancun! Great food and fun activities."
      }
    ]
  }
  