{
    "package_name": "Delphi Ancient Mysteries Tour",
    "country": "Greece",
    "duration_days": 2,
    "customer_rating": 4.7,
    "tour_cost_usd": 400,
    "region_description": "Delphi is a historic site in central Greece that was once considered the center of the world in ancient mythology. Known for the Oracle of Delphi, this UNESCO World Heritage site features stunning natural landscapes and significant archaeological ruins. Visitors can explore the ancient sanctuary, the Temple of Apollo, and the fascinating Delphi Archaeological Museum.",
    "places_to_visit": [
      {
        "name": "Oracle of Delphi",
        "description": "The Oracle of Delphi was a priestess who provided guidance and prophecies in ancient Greece, making Delphi a significant spiritual center."
      },
      {
        "name": "Temple of Apollo",
        "description": "The Temple of Apollo is the most important structure at Delphi, dedicated to the god Apollo. It housed the Oracle and is an architectural marvel."
      },
      {
        "name": "Delphi Archaeological Museum",
        "description": "The museum features a rich collection of artifacts from the site, showcasing the history and culture of ancient Greece."
      },
      {
        "name": "Mount Parnassus",
        "description": "Mount Parnassus offers breathtaking views of the surrounding landscapes and is a great spot for hiking and nature walks."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Delphi",
        "hotels": [
          {
            "name": "Amalia Hotel Delphi",
            "description": "A comfortable hotel with modern amenities and stunning views of the mountains.",
            "cost_per_night_usd": 150
          },
          {
            "name": "Hotel Delphi Palace",
            "description": "This hotel offers cozy accommodations and is conveniently located near the archaeological site.",
            "cost_per_night_usd": 120
          }
        ],
        "restaurants": [
          {
            "name": "Taverna To Patriko Mas",
            "description": "A traditional tavern offering delicious Greek cuisine with a cozy atmosphere.",
            "average_cost_per_person_usd": 30
          },
          {
            "name": "Delfiki Taverna",
            "description": "Delfiki Taverna is known for its fresh ingredients and homemade dishes, providing a taste of local flavors.",
            "average_cost_per_person_usd": 25
          }
        ]
      }
    ],
    "activities": [
      "Explore the ancient ruins of Delphi and the Temple of Apollo.",
      "Visit the Delphi Archaeological Museum.",
      "Hike on Mount Parnassus and enjoy breathtaking views.",
      "Dine at a local taverna and savor traditional Greek dishes."
    ],
    "tips_and_tricks": [
      "Wear comfortable shoes for walking and hiking.",
      "Visit early in the day to avoid crowds at the archaeological site.",
      "Try local specialties like moussaka and stuffed grape leaves."
    ],
    "emergency_contacts": {
      "tour_guide": "+30 21 1234 5678",
      "local_police": "100",
      "embassy": "+30 21 5678 9012"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Delphi",
        "activities": [
          "Arrival at Delphi and transfer to the hotel.",
          "Visit the Oracle of Delphi and the Temple of Apollo.",
          "Dinner at Taverna To Patriko Mas, enjoying local cuisine."
        ]
      },
      {
        "day": 2,
        "location": "Delphi",
        "activities": [
          "Visit the Delphi Archaeological Museum.",
          "Hike on Mount Parnassus and enjoy stunning views.",
          "Lunch at Delfiki Taverna.",
          "Check-out from the hotel and transfer to the next destination."
        ]
      }
    ],
    "customer_reviews": [
      {
        "name": "Mia R.",
        "rating": 4.8,
        "description": "Delphi is mesmerizing! The history and views are incredible."
      },
      {
        "name": "James T.",
        "rating": 4.7,
        "description": "A must-visit for history lovers. The site is amazing!"
      }
    ]
  }
  