{
    "package_name": "Galapagos Islands Exploration",
    "country": "Ecuador",
    "duration_days": 6,
    "customer_rating": 4.9,
    "tour_cost_usd": 3000,
    "region_description": "The Galapagos Islands, located in the Pacific Ocean, are an archipelago famous for their unique wildlife and stunning natural landscapes. As the inspiration for Charles Darwin's theory of evolution, the islands offer an unparalleled opportunity to see species found nowhere else on Earth. Visitors can explore pristine beaches, volcanic landscapes, and crystal-clear waters while encountering giant tortoises, marine iguanas, and various bird species. The Galapagos Islands are a haven for eco-tourism and adventure seekers, with activities such as snorkeling, hiking, and wildlife watching available throughout the islands.",
    "places_to_visit": [
      {
        "name": "Santa Cruz Island",
        "description": "Santa Cruz is known for its highland forests, giant tortoises, and the Charles Darwin Research Station, offering insights into conservation efforts."
      },
      {
        "name": "Isabela Island",
        "description": "Isabela is the largest island in the Galapagos and features stunning volcanic landscapes, including the Sierra Negra Volcano and beautiful beaches."
      },
      {
        "name": "Floreana Island",
        "description": "Floreana is known for its unique history, including pirates and whalers, and is home to beautiful beaches and wildlife."
      },
      {
        "name": "Española Island",
        "description": "Española Island is famous for its diverse wildlife, including the waved albatross and the iconic blowhole known as 'Devil's Crown.'"
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Santa Cruz Island",
        "hotels": [
          {
            "name": "Finch Bay Eco Hotel",
            "description": "This beachfront hotel offers eco-friendly accommodations, a restaurant, and easy access to Galapagos attractions.",
            "cost_per_night_usd": 350
          },
          {
            "name": "Hotel Angermeyer Waterfront Inn",
            "description": "A charming hotel located on the water's edge, providing comfortable rooms and a relaxing atmosphere.",
            "cost_per_night_usd": 220
          }
        ],
        "restaurants": [
          {
            "name": "The Galapagos Deli",
            "description": "A casual restaurant offering fresh sandwiches, salads, and local specialties, perfect for a quick meal.",
            "average_cost_per_person_usd": 25
          },
          {
            "name": "La Garrapata",
            "description": "A popular eatery known for its seafood dishes and relaxed atmosphere, ideal for enjoying a meal after a day of exploration.",
            "average_cost_per_person_usd": 40
          }
        ]
      }
    ],
    "activities": [
      "Explore Santa Cruz Island and visit the Charles Darwin Research Station.",
      "Snorkel in the crystal-clear waters around Isabela Island.",
      "Visit the unique wildlife and beautiful beaches of Floreana Island.",
      "Discover the stunning landscapes and wildlife on Española Island."
    ],
    "tips_and_tricks": [
      "Bring binoculars for wildlife viewing.",
      "Book excursions in advance to secure spots.",
      "Be respectful of wildlife and their habitats."
    ],
    "emergency_contacts": {
      "tour_guide": "+593 5 123 456",
      "local_police": "101",
      "embassy": "+593 2 555 5555"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Santa Cruz Island",
        "activities": [
          "Arrival at Baltra Airport and transfer to Santa Cruz Island.",
          "Check-in at the hotel and briefing on the tour.",
          "Dinner at La Garrapata."
        ]
      },
      {
        "day": 2,
        "location": "Isabela Island",
        "activities": [
          "Full day excursion to Isabela Island for snorkeling and beach exploration.",
          "Lunch on the island.",
          "Return to Santa Cruz for dinner and overnight stay."
        ]
      },
      {
        "day": 3,
        "location": "Floreana Island",
        "activities": [
          "Day trip to Floreana Island to explore its beaches and unique wildlife.",
          "Lunch on the beach.",
          "Return to Santa Cruz for dinner."
        ]
      },
      {
        "day": 4,
        "location": "Española Island",
        "activities": [
          "Visit Española Island for wildlife viewing and exploring the blowhole.",
          "Lunch on the island.",
          "Return to Santa Cruz for dinner."
        ]
      },
      {
        "day": 5,
        "location": "Santa Cruz Island",
        "activities": [
          "Free day for optional activities such as kayaking or hiking.",
          "Lunch at The Galapagos Deli.",
          "Dinner at the hotel."
        ]
      },
      {
        "day": 6,
        "location": "Departure",
        "activities": [
          "Check-out from the hotel and transfer to the airport for departure."
        ]
      }
    ],
    "customer_reviews": [
      {
        "name": "Liam A.",
        "rating": 5.0,
        "description": "The Galapagos Islands are incredible! I loved snorkeling with sea lions and seeing giant tortoises up close."
      },
      {
        "name": "Emma R.",
        "rating": 4.8,
        "description": "A once-in-a-lifetime experience! The wildlife and landscapes were absolutely stunning."
      }
    ]
  }
  