{
    "package_name": "Pyramids of Giza Exploration",
    "country": "Egypt",
    "duration_days": 4,
    "customer_rating": 4.8,
    "tour_cost_usd": 1200,
    "region_description": "The Pyramids of Giza are one of the most iconic symbols of ancient Egypt and are among the Seven Wonders of the Ancient World. Built as monumental tombs for pharaohs, these structures reflect the incredible engineering skills and architectural brilliance of the ancient Egyptians. The Great Pyramid of Giza, the largest of the three, is a marvel of precision and has stood for over 4,500 years. Visitors can explore the pyramids, the Sphinx, and the nearby Solar Boat Museum, gaining insight into ancient Egyptian culture and beliefs. The Giza Plateau is a captivating destination for history lovers and those interested in the mysteries of the past.",
    "places_to_visit": [
      {
        "name": "Great Pyramid of Giza",
        "description": "The largest and oldest of the three pyramids, built for Pharaoh Khufu, standing at 481 feet tall."
      },
      {
        "name": "The Sphinx",
        "description": "A mythical creature with the body of a lion and the head of a pharaoh, guarding the pyramids."
      },
      {
        "name": "Pyramid of Khafre",
        "description": "The second-largest pyramid, known for its well-preserved limestone casing at the top."
      },
      {
        "name": "Pyramid of Menkaure",
        "description": "The smallest of the three main pyramids, built for Pharaoh Menkaure, featuring three smaller queens' pyramids."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Giza",
        "hotels": [
          {
            "name": "Mena House Hotel",
            "description": "A luxury hotel with stunning views of the pyramids, offering elegant rooms and exceptional service.",
            "cost_per_night_usd": 300
          },
          {
            "name": "Steigenberger Pyramids Hotel",
            "description": "A modern hotel featuring comfortable accommodations and a swimming pool with pyramid views.",
            "cost_per_night_usd": 150
          }
        ],
        "restaurants": [
          {
            "name": "Felfela",
            "description": "A popular restaurant serving traditional Egyptian dishes in a cozy atmosphere.",
            "average_cost_per_person_usd": 20
          },
          {
            "name": "The Grill Restaurant",
            "description": "Offers a variety of Egyptian and international cuisine with beautiful views of the pyramids.",
            "average_cost_per_person_usd": 30
          }
        ]
      }
    ],
    "activities": [
      "Explore the Great Pyramid and learn about its history.",
      "Visit the Sphinx and take memorable photos.",
      "Discover the Pyramid of Khafre and its unique features.",
      "Enjoy a traditional Egyptian meal at a local restaurant."
    ],
    "tips_and_tricks": [
      "Bring water and wear sunscreen, as it can get hot during the day.",
      "Consider hiring a local guide for an informative experience.",
      "Visit the pyramids early in the morning to avoid crowds."
    ],
    "emergency_contacts": {
      "tour_guide": "+20 2 1234 5678",
      "local_police": "122",
      "embassy": "+20 2 791 2600"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Cairo",
        "activities": [
          "Arrival in Cairo and transfer to the hotel.",
          "Briefing on the tour and relax.",
          "Dinner at The Grill Restaurant."
        ]
      },
      {
        "day": 2,
        "location": "Giza",
        "activities": [
          "Full-day exploration of the Pyramids of Giza.",
          "Lunch at a local restaurant.",
          "Visit the Sphinx and the Solar Boat Museum."
        ]
      },
      {
        "day": 3,
        "location": "Cairo",
        "activities": [
          "Visit the Egyptian Museum to see ancient artifacts.",
          "Lunch at a local restaurant.",
          "Explore the bustling Khan El Khalili market for souvenirs."
        ]
      },
      {
        "day": 4,
        "location": "Departure",
        "activities": [
          "Check-out from the hotel and transfer to the airport for departure."
        ]
      }
    ],
    "customer_reviews": [
      {
        "name": "Olivia W.",
        "rating": 5.0,
        "description": "Visiting the pyramids was a dream come true! The history is incredible."
      },
      {
        "name": "Ethan K.",
        "rating": 4.7,
        "description": "The Sphinx and pyramids are amazing! A once-in-a-lifetime experience."
      }
    ]
  }
  