{
    "package_name": "Great Barrier Reef Adventure",
    "country": "Australia",
    "duration_days": 6,
    "customer_rating": 4.9,
    "tour_cost_usd": 1800,
    "region_description": "The Great Barrier Reef, one of the Seven Natural Wonders of the World, is a UNESCO World Heritage site located off the coast of Queensland, Australia. Stretching over 2,300 kilometers, this stunning reef system is home to thousands of marine species and offers unparalleled opportunities for snorkeling, scuba diving, and exploring vibrant underwater ecosystems. The reef is a paradise for nature lovers and adventure seekers, with crystal-clear waters, colorful coral formations, and a diverse array of marine life. Visitors can enjoy various activities, from scenic boat trips to relaxing on beautiful islands, making it a must-visit destination for anyone traveling to Australia.",
    "places_to_visit": [
      {
        "name": "Cairns",
        "description": "Cairns is the gateway to the Great Barrier Reef and offers a variety of tours and activities. The city features a beautiful waterfront, lush gardens, and vibrant markets."
      },
      {
        "name": "Port Douglas",
        "description": "Port Douglas is a picturesque coastal town known for its luxury resorts and stunning beaches. It's the perfect base for exploring the Great Barrier Reef and Daintree Rainforest."
      },
      {
        "name": "Green Island",
        "description": "Green Island is a coral cay located within the Great Barrier Reef, offering snorkeling, scuba diving, and relaxing beach experiences amidst lush tropical vegetation."
      },
      {
        "name": "Daintree Rainforest",
        "description": "Daintree Rainforest is one of the oldest rainforests in the world, offering a unique ecosystem with diverse flora and fauna. Guided tours provide insight into its rich biodiversity."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Cairns",
        "hotels": [
          {
            "name": "Shangri-La Hotel, The Marina",
            "description": "This luxurious hotel features stunning views of the marina, elegant accommodations, and direct access to various tours and activities.",
            "cost_per_night_usd": 350
          },
          {
            "name": "Cairns Plaza Hotel",
            "description": "Cairns Plaza Hotel offers comfortable accommodations with easy access to the city's attractions and the Great Barrier Reef.",
            "cost_per_night_usd": 150
          }
        ],
        "restaurants": [
          {
            "name": "Ochre Restaurant",
            "description": "Ochre Restaurant offers a unique dining experience featuring modern Australian cuisine with local ingredients and stunning views.",
            "average_cost_per_person_usd": 70
          },
          {
            "name": "C'est Bon",
            "description": "C'est Bon is a French restaurant in Cairns, known for its delicious dishes and intimate atmosphere, perfect for a romantic dinner.",
            "average_cost_per_person_usd": 60
          }
        ]
      }
    ],
    "activities": [
      "Snorkel or dive in the crystal-clear waters of the Great Barrier Reef.",
      "Take a scenic boat cruise to explore the reef.",
      "Visit Green Island for beach relaxation and snorkeling.",
      "Explore Daintree Rainforest with a guided tour."
    ],
    "tips_and_tricks": [
      "Book reef tours in advance, especially during peak season.",
      "Bring sunscreen and a hat for sun protection.",
      "Consider underwater cameras for capturing the vibrant marine life."
    ],
    "emergency_contacts": {
      "tour_guide": "+61 7 1234 5678",
      "local_police": "000",
      "embassy": "+61 7 5555 5555"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Cairns",
        "activities": [
          "Arrival at Cairns Airport and transfer to the hotel.",
          "Briefing on the tour and rest.",
          "Dinner at Ochre Restaurant."
        ]
      },
      {
        "day": 2,
        "location": "Great Barrier Reef",
        "activities": [
          "Full day reef tour, including snorkeling and lunch on board.",
          "Explore the underwater wonders of the Great Barrier Reef.",
          "Return to Cairns for dinner."
        ]
      },
      {
        "day": 3,
        "location": "Green Island",
        "activities": [
          "Morning visit to Green Island for snorkeling and relaxation.",
          "Lunch on the island.",
          "Return to Cairns and free afternoon for exploration.",
          "Dinner at C'est Bon."
        ]
      },
      {
        "day": 4,
        "location": "Daintree Rainforest",
        "activities": [
          "Full day tour of Daintree Rainforest, including guided walks.",
          "Lunch at a local café in Daintree.",
          "Return to Cairns for dinner and overnight stay."
        ]
      },
      {
        "day": 5,
        "location": "Cairns",
        "activities": [
          "Free day for optional activities like skydiving or a hot air balloon ride.",
          "Lunch at a local restaurant.",
          "Dinner and overnight stay at the hotel."
        ]
      },
      {
        "day": 6,
        "location": "Departure",
        "activities": [
          "Check-out from the hotel and transfer to the airport for departure."
        ]
      }
    ],
    "customer_reviews": [
      {
        "name": "Daniel P.",
        "rating": 5.0,
        "description": "An unforgettable experience! The Great Barrier Reef is breathtaking, and the tour was well organized."
      },
      {
        "name": "Sophie T.",
        "rating": 4.8,
        "description": "The snorkeling was incredible! I saw so many colorful fish and corals."
      }
    ]
  }
  