{
    "package_name": "Hanoi Heritage Tour",
    "country": "Vietnam",
    "duration_days": 4,
    "customer_rating": 4.8,
    "tour_cost_usd": 700,
    "region_description": "Hanoi, the capital city of Vietnam, is known for its rich history, stunning architecture, and vibrant street life. The city showcases a mix of traditional Vietnamese culture and French colonial influences. Visitors can explore ancient temples, visit the Ho Chi Minh Mausoleum, and wander through the bustling Old Quarter. Hanoi is also famous for its street food, offering a delightful culinary experience for travelers.",
    "places_to_visit": [
      {
        "name": "Ho Chi Minh Mausoleum",
        "description": "The Ho Chi Minh Mausoleum is a monumental tribute to the founder of modern Vietnam, housing the embalmed body of Ho Chi Minh in a grand structure."
      },
      {
        "name": "Old Quarter",
        "description": "Hanoi's Old Quarter is a bustling area filled with narrow streets, vibrant markets, and charming shops, offering a glimpse into the city's history and culture."
      },
      {
        "name": "Temple of Literature",
        "description": "The Temple of Literature is Vietnam's first national university, dedicated to Confucius. It features beautiful gardens and traditional Vietnamese architecture."
      },
      {
        "name": "Hoan Kiem Lake",
        "description": "Hoan Kiem Lake is a scenic lake in the heart of Hanoi, known for its peaceful ambiance and the iconic Ngoc Son Temple located on an island."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Hanoi",
        "hotels": [
          {
            "name": "Sofitel Legend Metropole Hanoi",
            "description": "Sofitel Legend Metropole Hanoi is a luxurious hotel known for its colonial elegance, exceptional service, and prime location in the city center.",
            "cost_per_night_usd": 400
          },
          {
            "name": "Hanoi Pearl Hotel",
            "description": "Hanoi Pearl Hotel offers comfortable accommodations and modern amenities, located near the Old Quarter and major attractions.",
            "cost_per_night_usd": 100
          }
        ],
        "restaurants": [
          {
            "name": "Cha Ca La Vong",
            "description": "Cha Ca La Vong is famous for its unique dish of grilled fish with turmeric and dill, served at a family-run restaurant with a rich history.",
            "average_cost_per_person_usd": 15
          },
          {
            "name": "Bun Cha Huong Lien",
            "description": "Bun Cha Huong Lien is renowned for its bun cha, a delicious grilled pork dish served with vermicelli noodles and fresh herbs.",
            "average_cost_per_person_usd": 10
          }
        ]
      }
    ],
    "activities": [
      "Visit the Ho Chi Minh Mausoleum and learn about Vietnam's history.",
      "Explore the bustling streets of the Old Quarter.",
      "Discover the Temple of Literature and its historical significance.",
      "Relax by Hoan Kiem Lake and visit Ngoc Son Temple."
    ],
    "tips_and_tricks": [
      "Try local street food for an authentic culinary experience.",
      "Be mindful of traffic when crossing the streets.",
      "Bargain when shopping in markets for better prices."
    ],
    "emergency_contacts": {
      "tour_guide": "+84 24 1234 5678",
      "local_police": "113",
      "embassy": "+84 24 8765 4321"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Hanoi",
        "activities": [
          "Arrival at Noi Bai International Airport and transfer to the hotel.",
          "Briefing on the tour and overview of Hanoi's attractions.",
          "Evening at leisure to explore the Old Quarter.",
          "Dinner at a local restaurant, trying traditional Vietnamese cuisine."
        ]
      },
      {
        "day": 2,
        "location": "Hanoi",
        "activities": [
          "Visit the Ho Chi Minh Mausoleum in the morning.",
          "Lunch at a nearby restaurant.",
          "Explore the Old Quarter and shop for local handicrafts.",
          "Dinner at Cha Ca La Vong, enjoying grilled fish."
        ]
      },
      {
        "day": 3,
        "location": "Hanoi",
        "activities": [
          "Discover the Temple of Literature in the morning.",
          "Lunch at Bun Cha Huong Lien, tasting local specialties.",
          "Relax by Hoan Kiem Lake and visit Ngoc Son Temple.",
          "Free time for evening activities or exploration."
        ]
      },
      {
        "day": 4,
        "location": "Departure",
        "activities": [
          "Check-out from the hotel and transfer to the airport for departure."
        ]
      }
    ],
    "customer_reviews": [
      {
        "name": "Olivia H.",
        "rating": 4.8,
        "description": "Hanoi is full of history and charm! Loved exploring the Old Quarter."
      },
      {
        "name": "Noah T.",
        "rating": 4.9,
        "description": "The food in Hanoi is amazing! Must try the street food."
      }
    ]
  }
  