{
    "package_name": "Komodo Island Adventure",
    "country": "Indonesia",
    "region": "Komodo",
    "duration_days": 4,
    "customer_rating": 4.9,
    "tour_cost_usd": 1200,
    "region_description": "Komodo Island is famous for its stunning natural beauty and unique wildlife, including the iconic Komodo dragons. This UNESCO World Heritage Site is part of the Komodo National Park, which features spectacular landscapes, crystal-clear waters, and diverse marine life. Visitors can explore pristine beaches, go snorkeling or diving in vibrant coral reefs, and hike through rugged terrains to witness the majestic Komodo dragons in their natural habitat. The combination of adventure and breathtaking scenery makes Komodo Island a must-visit destination for nature lovers and thrill-seekers.",
    "places_to_visit": [
      {
        "name": "Komodo National Park",
        "description": "Komodo National Park is a UNESCO World Heritage Site that includes the islands of Komodo, Rinca, and Padar. The park is famous for its Komodo dragons and offers stunning landscapes, including rugged hills, beaches, and marine biodiversity."
      },
      {
        "name": "Pink Beach",
        "description": "Pink Beach is renowned for its unique pink sand, created by crushed red coral. The beach is perfect for swimming, sunbathing, and snorkeling, offering a serene escape in a picturesque setting."
      },
      {
        "name": "Rinca Island",
        "description": "Rinca Island is one of the best places to see Komodo dragons in their natural habitat. The island features rugged landscapes and hiking trails, allowing visitors to observe these fascinating reptiles up close."
      },
      {
        "name": "Padar Island",
        "description": "Padar Island is famous for its stunning viewpoints and unique landscapes. The hike to the top rewards visitors with panoramic views of the surrounding islands and the vibrant blue sea."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Labuan Bajo",
        "hotels": [
          {
            "name": "Bintang Flores Hotel",
            "description": "Bintang Flores Hotel offers comfortable accommodations with stunning views of the sea. The hotel features a restaurant, outdoor pool, and easy access to Labuan Bajo's attractions.",
            "cost_per_night_usd": 100
          },
          {
            "name": "La Prima Hotel",
            "description": "La Prima Hotel is a modern hotel in Labuan Bajo, providing stylish rooms and a restaurant. It is conveniently located near the harbor for easy access to boat trips.",
            "cost_per_night_usd": 80
          }
        ],
        "restaurants": [
          {
            "name": "The Lounge",
            "description": "The Lounge is a cozy restaurant in Labuan Bajo, offering a variety of local and international dishes. The ambiance is relaxed, making it a great place to unwind after a day of exploring.",
            "average_cost_per_person_usd": 20
          },
          {
            "name": "Warung Mama",
            "description": "Warung Mama is a popular eatery known for its delicious Indonesian dishes. The casual setting and affordable prices make it a favorite among locals and tourists.",
            "average_cost_per_person_usd": 10
          }
        ]
      }
    ],
    "activities": [
      "Explore Komodo National Park and see the Komodo dragons.",
      "Relax and snorkel at Pink Beach.",
      "Hike to the viewpoint on Padar Island.",
      "Visit Rinca Island for more dragon sightings."
    ],
    "tips_and_tricks": [
      "Wear comfortable shoes for hiking and bring water.",
      "Use reef-safe sunscreen when swimming or snorkeling.",
      "Follow park guidelines for a safe experience with Komodo dragons."
    ],
    "emergency_contacts": {
      "tour_guide": "+62 812 7654 3210",
      "local_police": "110",
      "embassy": "+62 21 3432 1234"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Labuan Bajo",
        "activities": [
          "Arrival at Komodo Airport and transfer to the hotel.",
          "Briefing on the tour and overview of Komodo Island.",
          "Evening at leisure to explore Labuan Bajo.",
          "Dinner at a local restaurant, enjoying fresh seafood."
        ]
      },
      {
        "day": 2,
        "location": "Komodo National Park",
        "activities": [
          "Take a boat trip to Komodo National Park.",
          "Visit Rinca Island to see Komodo dragons in their natural habitat.",
          "Lunch on the boat with scenic views.",
          "Explore the park and enjoy the stunning landscapes."
        ]
      },
      {
        "day": 3,
        "location": "Pink Beach and Padar Island",
        "activities": [
          "Visit Pink Beach for swimming and snorkeling in the crystal-clear waters.",
          "Lunch on the beach with a view.",
          "Hike to the viewpoint on Padar Island for breathtaking views.",
          "Return to Labuan Bajo for dinner and overnight stay."
        ]
      },
      {
        "day": 4,
        "location": "Departure",
        "activities": [
          "Check-out from the hotel and transfer to the airport for departure."
        ]
      }
    ],
    "customer_reviews": [
      {
        "name": "Liam N.",
        "rating": 5,
        "description": "The Komodo Island tour was unforgettable! The landscapes and wildlife are stunning!"
      },
      {
        "name": "Sophia G.",
        "rating": 4.9,
        "description": "Seeing the Komodo dragons in person was a dream come true! Highly recommend this adventure."
      }
    ]
  }
  