{
    "package_name": "Madagascar Adventure",
    "country": "Madagascar",
    "duration_days": 10,
    "customer_rating": 4.6,
    "tour_cost_usd": 2500,
    "region_description": "Madagascar, the fourth largest island in the world, is renowned for its unique biodiversity, stunning landscapes, and vibrant cultures. Over 90% of the wildlife found in Madagascar is endemic, including the famous lemurs, chameleons, and various species of birds and plants. The island's diverse ecosystems range from lush rainforests to arid deserts, providing ample opportunities for adventure and exploration. Visitors can enjoy national parks, beautiful beaches, and rich local traditions, making Madagascar a top destination for nature lovers and adventure seekers alike.",
    "places_to_visit": [
      {
        "name": "Andasibe-Mantadia National Park",
        "description": "This national park is famous for its rich biodiversity, particularly its lemur population, including the indri, the largest living lemur. Visitors can explore lush rainforests and spot unique wildlife."
      },
      {
        "name": "Avenue of the Baobabs",
        "description": "Avenue of the Baobabs is a striking natural monument featuring towering baobab trees lining a dirt road. This iconic landscape is a must-visit for photography and scenic views."
      },
      {
        "name": "Nosy Be",
        "description": "Nosy Be is a beautiful island off the northwest coast of Madagascar known for its stunning beaches, clear waters, and vibrant marine life. It's a popular destination for snorkeling, diving, and relaxation."
      },
      {
        "name": "Isalo National Park",
        "description": "Isalo National Park features dramatic sandstone formations, deep canyons, and unique flora and fauna. The park offers numerous hiking trails with breathtaking views and opportunities for wildlife spotting."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Madagascar",
        "hotels": [
          {
            "name": "Ravintsara Wellness Hotel",
            "description": "Ravintsara Wellness Hotel offers eco-friendly accommodations surrounded by nature. The hotel features a spa, outdoor pool, and a restaurant serving local cuisine.",
            "cost_per_night_usd": 150
          },
          {
            "name": "Vanilla Hotel",
            "description": "Vanilla Hotel is a beachfront property in Nosy Be, offering luxurious accommodations, water sports, and stunning ocean views.",
            "cost_per_night_usd": 200
          }
        ],
        "restaurants": [
          {
            "name": "La Varangue",
            "description": "La Varangue is a popular restaurant in Antananarivo, offering a mix of Malagasy and French cuisine in a cozy atmosphere.",
            "average_cost_per_person_usd": 30
          },
          {
            "name": "Le Papillon",
            "description": "Le Papillon offers fresh seafood and local dishes in a beachfront setting in Nosy Be, perfect for a relaxing dinner.",
            "average_cost_per_person_usd": 40
          }
        ]
      }
    ],
    "activities": [
      "Explore the unique wildlife in Andasibe-Mantadia National Park.",
      "Take stunning photographs at Avenue of the Baobabs.",
      "Relax on the beaches of Nosy Be.",
      "Hike through Isalo National Park and discover its landscapes."
    ],
    "tips_and_tricks": [
      "Bring insect repellent for rainforest hikes.",
      "Learn a few basic Malagasy phrases to enhance interactions with locals.",
      "Try local street food for an authentic culinary experience."
    ],
    "emergency_contacts": {
      "tour_guide": "+261 34 12 345 67",
      "local_police": "17",
      "embassy": "+261 20 22 329 16"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Antananarivo",
        "activities": [
          "Arrival at Ivato International Airport and transfer to the hotel.",
          "Briefing on the tour and rest.",
          "Dinner at La Varangue."
        ]
      },
      {
        "day": 2,
        "location": "Andasibe-Mantadia National Park",
        "activities": [
          "Travel to Andasibe-Mantadia National Park.",
          "Guided evening walk to spot nocturnal wildlife.",
          "Dinner and overnight stay at Ravintsara Wellness Hotel."
        ]
      },
      {
        "day": 3,
        "location": "Andasibe-Mantadia National Park",
        "activities": [
          "Full-day exploration of the national park, spotting lemurs and unique flora.",
          "Lunch in the park.",
          "Return to the hotel for dinner."
        ]
      },
      {
        "day": 4,
        "location": "Avenue of the Baobabs",
        "activities": [
          "Travel to Avenue of the Baobabs.",
          "Photograph the iconic baobab trees.",
          "Lunch at a nearby restaurant.",
          "Continue to Morondava for overnight stay."
        ]
      },
      {
        "day": 5,
        "location": "Nosy Be",
        "activities": [
          "Travel to Nosy Be via flight or ferry.",
          "Relax at the hotel or explore the beach.",
          "Dinner at Le Papillon."
        ]
      },
      {
        "day": 6,
        "location": "Nosy Be",
        "activities": [
          "Full-day snorkeling or diving trip in the Nosy Be marine reserve.",
          "Lunch on the boat or at a beach café.",
          "Return to the hotel for dinner."
        ]
      },
      {
        "day": 7,
        "location": "Isalo National Park",
        "activities": [
          "Travel to Isalo National Park.",
          "Hiking tour through the park, exploring canyons and unique rock formations.",
          "Lunch during the hike.",
          "Dinner and overnight stay at a nearby lodge."
        ]
      },
      {
        "day": 8,
        "location": "Isalo National Park",
        "activities": [
          "Continue exploring Isalo National Park, visiting natural pools and waterfalls.",
          "Lunch at the lodge.",
          "Return to Antananarivo for overnight stay."
        ]
      },
      {
        "day": 9,
        "location": "Antananarivo",
        "activities": [
          "Explore the local markets and historical sites in Antananarivo.",
          "Lunch at a local restaurant.",
          "Dinner at the hotel."
        ]
      },
      {
        "day": 10,
        "location": "Departure",
        "activities": [
          "Check-out from the hotel and transfer to the airport for departure."
        ]
      }
    ],
    "customer_reviews": [
      {
        "name": "Zoe P.",
        "rating": 5.0,
        "description": "Madagascar is a true gem! The wildlife and landscapes are breathtaking."
      },
      {
        "name": "Jack D.",
        "rating": 4.5,
        "description": "An amazing adventure! The parks are stunning and the people are welcoming."
      }
    ]
  }
  