{
    "package_name": "Marrakech Magic",
    "country": "Morocco",
    "duration_days": 5,
    "customer_rating": 4.6,
    "tour_cost_usd": 800,
    "region_description": "Marrakech, known as the 'Red City' due to its distinct red sandstone buildings, is a vibrant destination that combines rich history, stunning architecture, and a bustling atmosphere. The city is famous for its medina, a UNESCO World Heritage Site, where visitors can explore narrow alleyways filled with markets, artisans, and local cuisine. Marrakech is also home to beautiful palaces, gardens, and mosques, showcasing the country's Islamic architecture and culture. The city's lively souks and the famous Jemaa el-Fnaa square, filled with street performers and food stalls, make it an unforgettable experience for travelers.",
    "places_to_visit": [
      {
        "name": "Jemaa el-Fnaa",
        "description": "Jemaa el-Fnaa is the main square in Marrakech and a UNESCO Masterpiece of the Oral and Intangible Heritage of Humanity. The square comes alive with street performers, food vendors, and markets, providing a unique cultural experience."
      },
      {
        "name": "Koutoubia Mosque",
        "description": "Koutoubia Mosque is the largest mosque in Marrakech and an iconic symbol of the city. Its stunning minaret, visible from various parts of the city, showcases exquisite Moorish architecture and intricate tile work."
      },
      {
        "name": "Majorelle Garden",
        "description": "Majorelle Garden is a beautiful botanical garden created by French painter Jacques Majorelle. The garden features exotic plants, vibrant colors, and the famous blue villa, which now houses the Yves Saint Laurent Museum."
      },
      {
        "name": "Bahia Palace",
        "description": "Bahia Palace is a stunning example of Moroccan architecture, known for its intricate tile work and lush gardens. The palace was built in the late 19th century and served as the residence of a grand vizier."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Marrakech",
        "hotels": [
          {
            "name": "La Mamounia",
            "description": "La Mamounia is a luxury hotel renowned for its opulent design and stunning gardens. With world-class amenities, fine dining, and a lavish spa, it offers a perfect escape in the heart of Marrakech.",
            "cost_per_night_usd": 600
          },
          {
            "name": "Riad Kniza",
            "description": "Riad Kniza is a charming boutique hotel located in the medina. It offers authentic Moroccan hospitality, comfortable accommodations, and a peaceful atmosphere, providing a unique cultural experience.",
            "cost_per_night_usd": 200
          }
        ],
        "restaurants": [
          {
            "name": "Le Tobsil",
            "description": "Le Tobsil is a renowned restaurant serving traditional Moroccan cuisine in a beautiful riad setting. Guests can enjoy a multi-course meal while experiencing the warm ambiance of Moroccan hospitality.",
            "average_cost_per_person_usd": 50
          },
          {
            "name": "Al Fassia",
            "description": "Al Fassia is famous for its authentic Moroccan dishes, especially the lamb tagine and couscous. The restaurant is run by women and offers a unique dining experience with a local touch.",
            "average_cost_per_person_usd": 40
          }
        ]
      }
    ],
    "activities": [
      "Wander through the bustling souks and shop for local crafts.",
      "Visit Koutoubia Mosque and admire its stunning architecture.",
      "Explore the tranquil Majorelle Garden and its vibrant colors.",
      "Experience traditional Moroccan cuisine at local restaurants."
    ],
    "tips_and_tricks": [
      "Bargain when shopping in the souks for the best prices.",
      "Dress modestly to respect local customs.",
      "Stay hydrated, especially when exploring the city."
    ],
    "emergency_contacts": {
      "tour_guide": "+212 6 1234 5678",
      "local_police": "19",
      "embassy": "+212 5376-11633"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Marrakech",
        "activities": [
          "Arrival at Marrakech Menara Airport and transfer to the hotel.",
          "Briefing on the tour and rest.",
          "Dinner at Le Tobsil, enjoying traditional Moroccan dishes and ambiance."
        ]
      },
      {
        "day": 2,
        "location": "Exploring Marrakech",
        "activities": [
          "Visit Jemaa el-Fnaa and experience its lively atmosphere.",
          "Explore the Koutoubia Mosque and learn about its history.",
          "Lunch at a local café.",
          "Afternoon visit to the Majorelle Garden.",
          "Dinner and overnight stay at the hotel."
        ]
      },
      {
        "day": 3,
        "location": "Historical Sites",
        "activities": [
          "Visit Bahia Palace and admire its architecture and gardens.",
          "Explore the Saadian Tombs and learn about Moroccan history.",
          "Lunch at Al Fassia, savoring local flavors.",
          "Free afternoon for shopping in the souks.",
          "Dinner at a local restaurant and overnight stay."
        ]
      },
      {
        "day": 4,
        "location": "Cultural Experience",
        "activities": [
          "Morning cooking class to learn about Moroccan cuisine.",
          "Enjoy the dishes prepared during the class for lunch.",
          "Visit the local market for an authentic shopping experience.",
          "Evening at leisure to explore the vibrant nightlife.",
          "Dinner and overnight stay at the hotel."
        ]
      },
      {
        "day": 5,
        "location": "Departure",
        "activities": [
          "Check-out from the hotel and transfer to the airport for departure."
        ]
      }
    ],
    "customer_reviews": [
      {
        "name": "Lucas D.",
        "rating": 5.0,
        "description": "Marrakech was a magical experience! The culture, food, and hospitality were unforgettable."
      },
      {
        "name": "Isabella S.",
        "rating": 4.8,
        "description": "The souks were amazing, and the food was delicious! I can't wait to go back."
      }
    ]
  }
  