{
    "package_name": "Mauritius Beach Getaway",
    "country": "Mauritius",
    "duration_days": 5,
    "customer_rating": 4.7,
    "tour_cost_usd": 1200,
    "region_description": "Mauritius is a stunning island nation located in the Indian Ocean, known for its picturesque beaches, lush green mountains, and vibrant culture. With a rich history influenced by various cultures, Mauritius offers a unique blend of traditions, cuisines, and languages. The island is famous for its luxury resorts, crystal-clear lagoons, and world-class diving and snorkeling spots. Visitors can explore the natural beauty of the island, enjoy water sports, and experience the vibrant local markets and festivals, making it an ideal destination for relaxation and adventure.",
    "places_to_visit": [
      {
        "name": "Le Morne Brabant",
        "description": "Le Morne Brabant is a UNESCO World Heritage site, known for its stunning mountain and historical significance. The area offers hiking trails with breathtaking views of the lagoon and surrounding landscapes."
      },
      {
        "name": "Île aux Cerfs",
        "description": "Île aux Cerfs is a beautiful island known for its white sandy beaches and turquoise waters. It's a popular spot for water sports, relaxation, and picnics."
      },
      {
        "name": "Black River Gorges National Park",
        "description": "Black River Gorges National Park is a nature reserve known for its rich biodiversity, hiking trails, and stunning waterfalls. Visitors can explore the park's lush forests and unique wildlife."
      },
      {
        "name": "Port Louis",
        "description": "Port Louis is the capital city of Mauritius, offering a vibrant atmosphere, local markets, and historical sites. Visitors can explore the waterfront and enjoy local cuisine."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Mauritius",
        "hotels": [
          {
            "name": "The St. Regis Mauritius Resort",
            "description": "The St. Regis Mauritius Resort is a luxury beachfront resort featuring elegant accommodations, gourmet dining, and a world-class spa, providing a perfect retreat for relaxation.",
            "cost_per_night_usd": 500
          },
          {
            "name": "Lux Belle Mare",
            "description": "Lux Belle Mare is a five-star resort known for its beautiful beachfront and vibrant atmosphere. It offers a range of activities, dining options, and a stunning pool.",
            "cost_per_night_usd": 400
          }
        ],
        "restaurants": [
          {
            "name": "La Table du Château",
            "description": "La Table du Château offers a fine dining experience in a historic setting. The restaurant serves a mix of Mauritian and international cuisine.",
            "average_cost_per_person_usd": 70
          },
          {
            "name": "The Beach House",
            "description": "The Beach House is a casual dining restaurant located by the beach, offering fresh seafood and local dishes in a relaxed atmosphere.",
            "average_cost_per_person_usd": 50
          }
        ]
      }
    ],
    "activities": [
      "Relax on the beautiful beaches of Île aux Cerfs.",
      "Hike to the summit of Le Morne Brabant for breathtaking views.",
      "Explore the lush trails of Black River Gorges National Park.",
      "Visit local markets in Port Louis for unique souvenirs."
    ],
    "tips_and_tricks": [
      "Rent a car to explore the island at your own pace.",
      "Try local street food for an authentic experience.",
      "Book activities in advance during peak season."
    ],
    "emergency_contacts": {
      "tour_guide": "+230 123 4567",
      "local_police": "999",
      "embassy": "+230 23 177 77"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Mauritius",
        "activities": [
          "Arrival at Sir Seewoosagur Ramgoolam International Airport and transfer to the hotel.",
          "Briefing on the tour and rest.",
          "Dinner at the hotel."
        ]
      },
      {
        "day": 2,
        "location": "Le Morne Brabant",
        "activities": [
          "Hiking trip to Le Morne Brabant for stunning views.",
          "Lunch at a local restaurant.",
          "Relax at the beach in the afternoon.",
          "Dinner at a beachfront restaurant."
        ]
      },
      {
        "day": 3,
        "location": "Île aux Cerfs",
        "activities": [
          "Day trip to Île aux Cerfs for relaxation and water activities.",
          "Lunch on the island.",
          "Return to the mainland for dinner."
        ]
      },
      {
        "day": 4,
        "location": "Black River Gorges National Park",
        "activities": [
          "Explore Black River Gorges National Park with guided hikes.",
          "Lunch at a picnic spot in the park.",
          "Visit a local market in the afternoon.",
          "Dinner at the hotel."
        ]
      },
      {
        "day": 5,
        "location": "Departure",
        "activities": [
          "Check-out from the hotel and transfer to the airport for departure."
        ]
      }
    ],
    "customer_reviews": [
      {
        "name": "Liam R.",
        "rating": 5.0,
        "description": "Mauritius is stunning! The beaches are perfect for relaxation, and the food is amazing."
      },
      {
        "name": "Ella S.",
        "rating": 4.7,
        "description": "We had a fantastic time exploring the island and enjoying the local culture!"
      }
    ]
  }
  