{
    "package_name": "Meteora Spiritual Retreat Tour",
    "country": "Greece",
    "duration_days": 3,
    "customer_rating": 4.9,
    "tour_cost_usd": 600,
    "region_description": "Meteora is a UNESCO World Heritage site located in central Greece, famous for its breathtaking rock formations and historic monasteries. Perched atop towering cliffs, these monasteries date back to the 14th century and offer a unique blend of natural beauty and spiritual significance. Visitors can explore the stunning landscapes, hike scenic trails, and learn about the rich monastic tradition of the area.",
    "places_to_visit": [
      {
        "name": "Great Meteoron Monastery",
        "description": "The Great Meteoron Monastery is the largest and oldest of the Meteora monasteries, offering stunning views and a glimpse into monastic life."
      },
      {
        "name": "Varlaam Monastery",
        "description": "Varlaam Monastery is known for its beautiful frescoes and historical significance. It offers visitors a chance to learn about the monastic tradition."
      },
      {
        "name": "Rousanou Monastery",
        "description": "Rousanou Monastery is smaller and known for its peaceful atmosphere and scenic views. It is an ideal spot for reflection and tranquility."
      },
      {
        "name": "Meteora Hiking Trails",
        "description": "The hiking trails around Meteora offer breathtaking views of the rock formations and are perfect for outdoor enthusiasts."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Kalambaka",
        "hotels": [
          {
            "name": "Hotel Meteoritis",
            "description": "A comfortable hotel with modern amenities and stunning views of Meteora.",
            "cost_per_night_usd": 100
          },
          {
            "name": "Dellas Boutique Hotel",
            "description": "This boutique hotel offers cozy accommodations and is conveniently located near the monasteries.",
            "cost_per_night_usd": 120
          }
        ],
        "restaurants": [
          {
            "name": "Taverna Gardenia",
            "description": "A local tavern offering delicious Greek cuisine with a cozy atmosphere.",
            "average_cost_per_person_usd": 30
          },
          {
            "name": "Restaurant Meteora",
            "description": "Known for its fresh ingredients and homemade dishes, Restaurant Meteora provides a taste of local flavors.",
            "average_cost_per_person_usd": 25
          }
        ]
      }
    ],
    "activities": [
      "Explore the monasteries of Meteora and learn about their history.",
      "Hike the trails and enjoy breathtaking views of the rock formations.",
      "Dine at a local taverna and savor traditional Greek dishes.",
      "Relax and reflect in the serene surroundings."
    ],
    "tips_and_tricks": [
      "Dress modestly when visiting monasteries.",
      "Wear comfortable shoes for hiking and exploring.",
      "Try local wines and cheeses while dining."
    ],
    "emergency_contacts": {
      "tour_guide": "+30 21 1234 5678",
      "local_police": "100",
      "embassy": "+30 21 5678 9012"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Kalambaka",
        "activities": [
          "Arrival at Kalambaka and transfer to the hotel.",
          "Visit the Great Meteoron Monastery and explore its grounds.",
          "Dinner at Taverna Gardenia, enjoying local cuisine."
        ]
      },
      {
        "day": 2,
        "location": "Meteora",
        "activities": [
          "Visit Varlaam Monastery and learn about its history.",
          "Hike the trails for stunning views of Meteora.",
          "Lunch at Restaurant Meteora.",
          "Visit Rousanou Monastery and relax in the peaceful atmosphere."
        ]
      },
      {
        "day": 3,
        "location": "Departure",
        "activities": [
          "Check-out from the hotel and transfer to the airport or next destination."
        ]
      }
    ],
    "customer_reviews": [
      {
        "name": "Lucas B.",
        "rating": 5.0,
        "description": "Meteora is breathtaking! The monasteries and views are extraordinary."
      },
      {
        "name": "Emma J.",
        "rating": 4.9,
        "description": "A spiritual experience like no other. Highly recommend this tour!"
      }
    ]
  }
  