{
    "package_name": "New York City Adventure",
    "country": "USA",
    "duration_days": 5,
    "customer_rating": 4.9,
    "tour_cost_usd": 1500,
    "region_description": "New York City, often referred to as 'The Big Apple,' is a vibrant metropolis known for its iconic skyline, rich history, and diverse culture. This bustling city is home to world-renowned landmarks such as the Statue of Liberty, Central Park, and Times Square. NYC is a cultural melting pot, offering a myriad of cuisines, arts, and entertainment options. Visitors can explore its various neighborhoods, each with its own unique character, from the historic charm of Greenwich Village to the modern allure of Hudson Yards. The city's energy and creativity make it a must-visit destination for travelers worldwide.",
    "places_to_visit": [
      {
        "name": "Statue of Liberty",
        "description": "A symbol of freedom and democracy, the Statue of Liberty is a colossal sculpture located on Liberty Island, welcoming visitors to New York Harbor."
      },
      {
        "name": "Central Park",
        "description": "An expansive green oasis in the heart of Manhattan, Central Park offers walking paths, lakes, and recreational areas, providing a perfect escape from the urban hustle."
      },
      {
        "name": "Times Square",
        "description": "Known as 'The Crossroads of the World,' Times Square is famous for its bright lights, theaters, and bustling atmosphere, making it a vibrant hub for entertainment and commerce."
      },
      {
        "name": "Empire State Building",
        "description": "An iconic skyscraper that offers breathtaking views of the city from its observation decks, the Empire State Building is a must-see landmark in NYC."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "New York City",
        "hotels": [
          {
            "name": "The Ritz-Carlton New York, Central Park",
            "description": "A luxurious hotel offering stunning views of Central Park and elegant accommodations, known for its top-notch service.",
            "cost_per_night_usd": 700
          },
          {
            "name": "The Standard, High Line",
            "description": "A trendy hotel located in the Meatpacking District, offering modern amenities and a vibrant rooftop bar with panoramic views.",
            "cost_per_night_usd": 350
          }
        ],
        "restaurants": [
          {
            "name": "Le Bernardin",
            "description": "An upscale seafood restaurant that boasts three Michelin stars, known for its exquisite French cuisine and impeccable service.",
            "average_cost_per_person_usd": 150
          },
          {
            "name": "Katz's Delicatessen",
            "description": "A famous deli known for its classic pastrami sandwiches and a quintessential New York dining experience.",
            "average_cost_per_person_usd": 30
          }
        ]
      }
    ],
    "activities": [
      "Visit the Statue of Liberty and Ellis Island.",
      "Explore Central Park and its attractions.",
      "Experience the vibrant atmosphere of Times Square.",
      "Enjoy panoramic views from the Empire State Building."
    ],
    "tips_and_tricks": [
      "Purchase a MetroCard for easy access to public transportation.",
      "Book tickets for popular attractions in advance.",
      "Try street food vendors for a taste of local cuisine."
    ],
    "emergency_contacts": {
      "tour_guide": "+1 212 123 4567",
      "local_police": "911",
      "embassy": "+1 202 555 0143"
    },
    "timeline": [
      {
        "day": 1,
        "location": "New York City",
        "activities": [
          "Arrival in New York City and transfer to the hotel.",
          "Briefing on the tour and relax.",
          "Dinner at Katz's Delicatessen."
        ]
      },
      {
        "day": 2,
        "location": "Statue of Liberty",
        "activities": [
          "Morning ferry to the Statue of Liberty and Ellis Island.",
          "Lunch at a local café.",
          "Afternoon visit to the 9/11 Memorial and Museum.",
          "Dinner and overnight stay at the hotel."
        ]
      },
      {
        "day": 3,
        "location": "Central Park",
        "activities": [
          "Morning stroll through Central Park, including visits to the Bethesda Terrace and Strawberry Fields.",
          "Lunch at a park café.",
          "Afternoon free for shopping or exploring Fifth Avenue.",
          "Dinner at Le Bernardin."
        ]
      },
      {
        "day": 4,
        "location": "Times Square & Empire State Building",
        "activities": [
          "Morning exploration of Times Square and its attractions.",
          "Lunch in the area.",
          "Visit the Empire State Building for breathtaking views.",
          "Dinner and a Broadway show in the evening."
        ]
      },
      {
        "day": 5,
        "location": "Departure",
        "activities": [
          "Check-out from the hotel and transfer to the airport for departure."
        ]
      }
    ],
    "customer_reviews": [
      {
        "name": "Olivia R.",
        "rating": 5.0,
        "description": "A fantastic tour of NYC! The Statue of Liberty and Central Park were highlights of my trip."
      },
      {
        "name": "James T.",
        "rating": 4.8,
        "description": "Amazing experience! The Broadway show was a highlight, and the food was delicious."
      }
    ]
  }
  