{
    "package_name": "Nice Coastal Getaway",
    "country": "France",
    "duration_days": 5,
    "customer_rating": 4.7,
    "tour_cost_usd": 1200,
    "region_description": "Nice, located on the French Riviera, is renowned for its stunning beaches, vibrant arts scene, and mild Mediterranean climate. The city's beautiful Promenade des Anglais stretches along the coast, offering breathtaking views of the azure sea. Nice is also famous for its historic Old Town, charming markets, and vibrant nightlife. The city’s rich cultural heritage is reflected in its art galleries, museums, and local festivals, making it a perfect destination for relaxation and exploration.",
    "places_to_visit": [
      {
        "name": "Promenade des Anglais",
        "description": "A famous seaside promenade lined with palm trees, restaurants, and stunning views of the Mediterranean."
      },
      {
        "name": "Old Town (Vieux Nice)",
        "description": "A charming district filled with narrow streets, colorful buildings, and bustling markets."
      },
      {
        "name": "Castle Hill (Colline du Château)",
        "description": "A hilltop park offering panoramic views of Nice and the surrounding coastline."
      },
      {
        "name": "Matisse Museum",
        "description": "A museum dedicated to the works of Henri Matisse, showcasing his colorful paintings and artworks."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Nice",
        "hotels": [
          {
            "name": "Negresco Hotel",
            "description": "A luxury hotel known for its iconic pink dome and exquisite decor, located on the Promenade des Anglais.",
            "cost_per_night_usd": 500
          },
          {
            "name": "Radisson Blu Hotel",
            "description": "A modern hotel with a stunning rooftop terrace, offering breathtaking views of the Mediterranean Sea.",
            "cost_per_night_usd": 300
          }
        ],
        "restaurants": [
          {
            "name": "Le Chantecler",
            "description": "A Michelin-starred restaurant offering exquisite French cuisine and an elegant dining experience.",
            "average_cost_per_person_usd": 100
          },
          {
            "name": "La Merenda",
            "description": "A cozy eatery known for its traditional Niçoise dishes, emphasizing fresh, local ingredients.",
            "average_cost_per_person_usd": 30
          }
        ]
      }
    ],
    "activities": [
      "Stroll along the Promenade des Anglais and enjoy the coastal views.",
      "Explore the vibrant Old Town and visit the local markets.",
      "Hike up Castle Hill for stunning panoramic views of the city.",
      "Visit the Matisse Museum to admire the works of the famous artist."
    ],
    "tips_and_tricks": [
      "Try the local specialty, socca, a chickpea pancake.",
      "Visit the local flower market for a burst of color.",
      "Consider taking a day trip to nearby towns like Eze or Antibes."
    ],
    "emergency_contacts": {
      "tour_guide": "+33 4 92 00 00 00",
      "local_police": "17",
      "embassy": "+33 1 43 12 22 22"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Nice",
        "activities": [
          "Arrival at Nice Côte d'Azur Airport and transfer to the hotel.",
          "Briefing on the tour and relax at the beach.",
          "Dinner at Le Chantecler."
        ]
      },
      {
        "day": 2,
        "location": "Nice",
        "activities": [
          "Stroll along the Promenade des Anglais in the morning.",
          "Lunch at a café in Old Town.",
          "Explore the Old Town and visit local shops.",
          "Dinner at La Merenda."
        ]
      },
      {
        "day": 3,
        "location": "Nice",
        "activities": [
          "Hike up Castle Hill for stunning views.",
          "Lunch at a local restaurant.",
          "Visit the Matisse Museum in the afternoon.",
          "Evening at leisure."
        ]
      },
      {
        "day": 4,
        "location": "Nice",
        "activities": [
          "Free day for optional activities or beach relaxation.",
          "Lunch at a beachside café.",
          "Explore the local markets in the afternoon."
        ]
      },
      {
        "day": 5,
        "location": "Departure",
        "activities": [
          "Check-out from the hotel.",
          "Transfer to the airport for departure."
        ]
      }
    ],
    "customer_reviews": [
      {
        "name": "Emma S.",
        "rating": 5.0,
        "description": "Nice is breathtaking! The beaches and Old Town are charming."
      },
      {
        "name": "James T.",
        "rating": 4.8,
        "description": "A perfect blend of relaxation and culture. Highly recommend!"
      }
    ]
  }
  