{
    "package_name": "Machu Picchu Adventure",
    "country": "Peru",
    "duration_days": 5,
    "customer_rating": 4.9,
    "tour_cost_usd": 1600,
    "region_description": "Machu Picchu, one of the New Seven Wonders of the World, is an ancient Incan citadel set high in the Andes Mountains of Peru. This UNESCO World Heritage site is famous for its archaeological significance and breathtaking scenery. The site features impressive stone constructions and terraced fields that showcase the advanced engineering skills of the Incas. Visitors can explore the ruins, hike the surrounding mountains, and learn about the rich history and culture of the Inca civilization. The journey to Machu Picchu is equally captivating, with stunning landscapes and the option to trek along the Inca Trail.",
    "places_to_visit": [
      {
        "name": "Machu Picchu",
        "description": "Machu Picchu is an ancient Incan city known for its sophisticated dry-stone construction and stunning panoramic views of the Andes. It's a must-see for anyone visiting Peru."
      },
      {
        "name": "Cusco",
        "description": "Cusco was the capital of the Inca Empire and is rich in history and culture. The city features colonial architecture, vibrant markets, and serves as the gateway to Machu Picchu."
      },
      {
        "name": "Sacred Valley",
        "description": "The Sacred Valley is a picturesque region filled with ancient Incan ruins, traditional villages, and stunning landscapes, providing insight into the culture and history of the Incas."
      },
      {
        "name": "Ollantaytambo",
        "description": "Ollantaytambo is a well-preserved Incan town known for its impressive archaeological site and terraced ruins, offering stunning views of the surrounding valley."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Aguas Calientes",
        "hotels": [
          {
            "name": "Inkaterra Machu Picchu Pueblo Hotel",
            "description": "Nestled in the cloud forest, this luxurious hotel features beautiful gardens, a spa, and elegant accommodations, providing a serene escape.",
            "cost_per_night_usd": 400
          },
          {
            "name": "El MaPi Hotel",
            "description": "A contemporary hotel with a warm atmosphere, offering comfortable rooms and easy access to the train station for Machu Picchu.",
            "cost_per_night_usd": 150
          }
        ],
        "restaurants": [
          {
            "name": "Indio Feliz",
            "description": "Indio Feliz is a cozy restaurant offering a mix of Peruvian and French cuisine, famous for its warm ambiance and delicious dishes.",
            "average_cost_per_person_usd": 50
          },
          {
            "name": "Tree House Restaurant",
            "description": "A unique dining experience offering local flavors with stunning views of the surrounding mountains, perfect for relaxing after a day of exploration.",
            "average_cost_per_person_usd": 40
          }
        ]
      }
    ],
    "activities": [
      "Explore the ancient ruins of Machu Picchu.",
      "Take a guided tour of Cusco and learn about its history.",
      "Visit the Sacred Valley and its archaeological sites.",
      "Hike to Ollantaytambo and explore its terraced ruins."
    ],
    "tips_and_tricks": [
      "Book tickets to Machu Picchu in advance to secure your entry.",
      "Consider taking the train from Cusco for a scenic journey.",
      "Wear comfortable walking shoes for exploring the ruins."
    ],
    "emergency_contacts": {
      "tour_guide": "+51 84 123 456",
      "local_police": "105",
      "embassy": "+51 1 555 5555"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Cusco",
        "activities": [
          "Arrival at Cusco Airport and transfer to the hotel.",
          "Briefing on the tour and rest.",
          "Dinner at a local restaurant."
        ]
      },
      {
        "day": 2,
        "location": "Sacred Valley",
        "activities": [
          "Full day tour of the Sacred Valley, including Pisac and Ollantaytambo.",
          "Lunch in a local village.",
          "Return to Cusco for dinner."
        ]
      },
      {
        "day": 3,
        "location": "Aguas Calientes",
        "activities": [
          "Travel by train to Aguas Calientes.",
          "Free afternoon to explore the town.",
          "Dinner at Indio Feliz."
        ]
      },
      {
        "day": 4,
        "location": "Machu Picchu",
        "activities": [
          "Early morning visit to Machu Picchu for a guided tour.",
          "Lunch at the Tree House Restaurant.",
          "Afternoon hike to Huayna Picchu for panoramic views.",
          "Return to Aguas Calientes for dinner and overnight stay."
        ]
      },
      {
        "day": 5,
        "location": "Departure",
        "activities": [
          "Travel back to Cusco by train.",
          "Check-out from the hotel and transfer to the airport for departure."
        ]
      }
    ],
    "customer_reviews": [
      {
        "name": "Emily J.",
        "rating": 5.0,
        "description": "Machu Picchu is breathtaking! The guided tour was informative, and the views were unforgettable."
      },
      {
        "name": "Michael T.",
        "rating": 4.8,
        "description": "An amazing experience! The Sacred Valley tour was a highlight, and the food was fantastic."
      }
    ]
  }
  