{
    "package_name": "Prague: The City of a Hundred Spires",
    "country": "Czech Republic",
    "duration_days": 4,
    "customer_rating": 4.7,
    "tour_cost_usd": 900,
    "region_description": "Prague, the capital city of the Czech Republic, is known for its stunning architecture, rich history, and vibrant culture. Founded in the 9th century, Prague boasts a beautifully preserved medieval city center that is a UNESCO World Heritage Site. The city's iconic landmarks include the Charles Bridge, Prague Castle, and the Astronomical Clock. With its charming streets, lively squares, and numerous cafes, Prague offers visitors a unique blend of history and modernity, making it an enchanting destination for travelers.",
    "places_to_visit": [
      {
        "name": "Prague Castle",
        "description": "Prague Castle is a historic fortress complex that has been the seat of Czech kings and presidents for over a thousand years, offering stunning views of the city."
      },
      {
        "name": "Charles Bridge",
        "description": "Charles Bridge is a historic stone bridge adorned with statues, connecting the Old Town with the Lesser Town, and offering beautiful views of the Vltava River."
      },
      {
        "name": "Old Town Square",
        "description": "Old Town Square is the heart of Prague, featuring the Astronomical Clock, historic buildings, and lively markets, making it a popular gathering place."
      },
      {
        "name": "Jewish Quarter",
        "description": "The Jewish Quarter, or Josefov, is home to several historic synagogues and the Jewish Museum, showcasing the rich history of Jewish life in Prague."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Prague",
        "hotels": [
          {
            "name": "Hotel Paris Prague",
            "description": "Hotel Paris is a luxury hotel with Art Nouveau style, offering elegant rooms and a prime location near major attractions.",
            "cost_per_night_usd": 300
          },
          {
            "name": "Alchymist Grand Hotel & Spa",
            "description": "Alchymist Grand Hotel & Spa is a boutique hotel located in a historic building, featuring luxurious accommodations and a wellness center.",
            "cost_per_night_usd": 350
          }
        ],
        "restaurants": [
          {
            "name": "Lokál Dlouháá",
            "description": "Lokál Dlouháá is a popular restaurant serving traditional Czech cuisine and locally brewed beer in a vibrant setting.",
            "average_cost_per_person_usd": 30
          },
          {
            "name": "Café Louvre",
            "description": "Café Louvre is a historic café known for its elegant interior and delicious pastries, a great spot for a relaxing break.",
            "average_cost_per_person_usd": 20
          }
        ]
      }
    ],
    "activities": [
      "Visit Prague Castle and explore its grounds.",
      "Walk across Charles Bridge and admire the views.",
      "Discover the beauty of Old Town Square.",
      "Explore the Jewish Quarter and its historical significance."
    ],
    "tips_and_tricks": [
      "Consider getting a Prague Card for discounts on attractions.",
      "Try local dishes such as goulash and trdelník.",
      "Use public transport for easy access around the city."
    ],
    "emergency_contacts": {
      "tour_guide": "+420 123 456 789",
      "local_police": "158",
      "embassy": "+420 224 373 111"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Prague",
        "activities": [
          "Arrival at Václav Havel Airport and transfer to the hotel.",
          "Briefing on the tour and rest.",
          "Dinner at Lokál Dlouháá, enjoying traditional Czech cuisine."
        ]
      },
      {
        "day": 2,
        "location": "Prague",
        "activities": [
          "Visit Prague Castle and explore its stunning grounds.",
          "Lunch at a nearby café.",
          "Walk across Charles Bridge and enjoy the views.",
          "Dinner at Café Louvre, savoring delicious pastries."
        ]
      },
      {
        "day": 3,
        "location": "Prague",
        "activities": [
          "Discover the beauty of Old Town Square and its attractions.",
          "Lunch at a local restaurant.",
          "Explore the Jewish Quarter and learn about its history.",
          "Dinner and overnight stay at the hotel."
        ]
      },
      {
        "day": 4,
        "location": "Prague",
        "activities": [
          "Free day for optional activities or further exploration.",
          "Lunch at a local eatery.",
          "Dinner and overnight stay at the hotel."
        ]
      },
      {
        "day": 5,
        "location": "Departure",
        "activities": [
          "Check-out from the hotel and transfer to the airport for departure."
        ]
      }
    ],
    "customer_reviews": [
      {
        "name": "Lucas M.",
        "rating": 4.9,
        "description": "Prague is magical! The architecture and history are breathtaking."
      },
      {
        "name": "Mia S.",
        "rating": 4.8,
        "description": "A fantastic trip! The Charles Bridge was a highlight."
      }
    ]
  }
  