{
    "package_name": "Vancouver City Tour",
    "country": "Canada",
    "duration_days": 4,
    "customer_rating": 4.6,
    "tour_cost_usd": 1100,
    "region_description": "Vancouver, located on the west coast of Canada, is a vibrant city known for its stunning natural beauty, multicultural atmosphere, and outdoor activities. Surrounded by mountains and the Pacific Ocean, Vancouver offers a unique blend of urban life and nature. Visitors can explore Stanley Park, walk along the seawall, and enjoy the city's diverse culinary scene. The city is also a gateway to nearby attractions, such as Whistler and Victoria, making it an ideal base for adventure and exploration. With its mild climate and welcoming locals, Vancouver is a popular destination for travelers seeking both relaxation and excitement.",
    "places_to_visit": [
      {
        "name": "Stanley Park",
        "description": "A massive urban park offering scenic views, walking trails, and a picturesque seawall, perfect for outdoor activities."
      },
      {
        "name": "Granville Island",
        "description": "A vibrant area featuring a public market, artisan shops, and waterfront dining, showcasing local arts and culture."
      },
      {
        "name": "Capilano Suspension Bridge Park",
        "description": "A thrilling suspension bridge that offers stunning views of the surrounding rainforest and river below."
      },
      {
        "name": "Gastown",
        "description": "Vancouver's oldest neighborhood, known for its historic architecture, shops, and the famous Gastown Steam Clock."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Vancouver",
        "hotels": [
          {
            "name": "Fairmont Pacific Rim",
            "description": "A luxurious hotel located near the waterfront, offering elegant rooms, a spa, and fine dining.",
            "cost_per_night_usd": 450
          },
          {
            "name": "Blue Horizon Hotel",
            "description": "A comfortable hotel with modern amenities, providing stunning views of the city and mountains.",
            "cost_per_night_usd": 200
          }
        ],
        "restaurants": [
          {
            "name": "Miku",
            "description": "A renowned restaurant specializing in sushi and Japanese cuisine, known for its fresh ingredients and beautiful presentation.",
            "average_cost_per_person_usd": 70
          },
          {
            "name": "The Sandbar Seafood Restaurant",
            "description": "A waterfront restaurant offering a variety of fresh seafood dishes and a relaxed dining atmosphere.",
            "average_cost_per_person_usd": 50
          }
        ]
      }
    ],
    "activities": [
      "Explore Stanley Park and walk the seawall.",
      "Visit Granville Island Public Market.",
      "Experience the thrill of the Capilano Suspension Bridge.",
      "Discover the history of Gastown."
    ],
    "tips_and_tricks": [
      "Use public transport or rent a bike to explore the city.",
      "Try local craft beer at one of Vancouver's many breweries.",
      "Plan for rain, as Vancouver has a mild but wet climate."
    ],
    "emergency_contacts": {
      "tour_guide": "+1 604 123 4567",
      "local_police": "911",
      "embassy": "+1 613 555 6789"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Vancouver",
        "activities": [
          "Arrival in Vancouver and transfer to the hotel.",
          "Briefing on the tour and relax.",
          "Dinner at The Sandbar Seafood Restaurant."
        ]
      },
      {
        "day": 2,
        "location": "Stanley Park",
        "activities": [
          "Morning visit to Stanley Park and walk the seawall.",
          "Lunch at a café in the park.",
          "Afternoon visit to Granville Island.",
          "Dinner at Miku."
        ]
      },
      {
        "day": 3,
        "location": "Capilano Suspension Bridge Park",
        "activities": [
          "Day trip to Capilano Suspension Bridge Park.",
          "Lunch at a local restaurant near the park.",
          "Return to Vancouver for dinner at a local restaurant."
        ]
      },
      {
        "day": 4,
        "location": "Gastown",
        "activities": [
          "Explore the historic neighborhood of Gastown.",
          "Lunch at a nearby café.",
          "Afternoon at leisure or shopping.",
          "Check-out from the hotel and transfer to the airport for departure."
        ]
      }
    ],
    "customer_reviews": [
      {
        "name": "Sophia W.",
        "rating": 5.0,
        "description": "Vancouver is incredible! The views and activities were amazing."
      },
      {
        "name": "Liam T.",
        "rating": 4.9,
        "description": "Stanley Park was my favorite part! So beautiful and peaceful."
      }
    ]
  }
  