{
    "package_name": "Victoria Falls Adventure",
    "country": "Zimbabwe",
    "duration_days": 4,
    "customer_rating": 4.7,
    "tour_cost_usd": 900,
    "region_description": "Victoria Falls, known as Mosi-oa-Tunya or 'The Smoke That Thunders,' is one of the largest and most famous waterfalls in the world. Straddling the border between Zimbabwe and Zambia, this natural wonder is a UNESCO World Heritage Site and attracts thousands of visitors each year. The falls are nearly a mile wide and drop over 100 meters into a gorge below, creating a stunning spectacle of mist and rainbows. Visitors can engage in various activities, such as white-water rafting, bungee jumping, and helicopter tours, offering a unique perspective of this magnificent site.",
    "places_to_visit": [
      {
        "name": "Victoria Falls National Park",
        "description": "Victoria Falls National Park is home to the spectacular waterfall and offers stunning viewpoints along its trails. Visitors can explore the diverse flora and fauna of the park and enjoy various activities, including guided tours and sunset cruises."
      },
      {
        "name": "Zambezi River",
        "description": "The Zambezi River, which flows into Victoria Falls, offers thrilling adventure activities like white-water rafting and canoeing. The river is also a fantastic place to spot wildlife and enjoy scenic boat cruises."
      },
      {
        "name": "Livingstone Island",
        "description": "Livingstone Island is a small island located on the Zambezi River, right above the falls. It offers breathtaking views and is the perfect spot for swimming in the Devil’s Pool during the dry season, allowing visitors to experience the falls up close."
      },
      {
        "name": "Mosi-oa-Tunya National Park",
        "description": "Mosi-oa-Tunya National Park is known for its diverse wildlife, including elephants and various bird species. Visitors can enjoy game drives and guided walking safaris while exploring the park’s natural beauty."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Victoria Falls",
        "hotels": [
          {
            "name": "The Victoria Falls Hotel",
            "description": "The Victoria Falls Hotel is a historic hotel offering luxury accommodations and stunning views of the falls. With elegant rooms and fine dining options, it provides a perfect base for exploring the area.",
            "cost_per_night_usd": 400
          },
          {
            "name": "Ilala Lodge Hotel",
            "description": "Ilala Lodge Hotel is a charming hotel located near the falls. It features comfortable accommodations and a restaurant with views of the Zambezi River, making it an ideal choice for travelers.",
            "cost_per_night_usd": 200
          }
        ],
        "restaurants": [
          {
            "name": "The Lookout Cafe",
            "description": "The Lookout Cafe offers stunning views of Victoria Falls and serves a variety of international and local dishes. It’s a great place to relax and enjoy a meal while taking in the beautiful scenery.",
            "average_cost_per_person_usd": 40
          },
          {
            "name": "The Boma – Dinner & Drum Show",
            "description": "The Boma offers a unique dining experience featuring traditional Zimbabwean cuisine and a lively drum show. Guests can enjoy a cultural evening with great food and entertainment.",
            "average_cost_per_person_usd": 60
          }
        ]
      }
    ],
    "activities": [
      "Explore Victoria Falls National Park and enjoy various viewpoints.",
      "Take a thrilling white-water rafting trip on the Zambezi River.",
      "Experience the stunning views from Livingstone Island.",
      "Enjoy a sunset cruise on the Zambezi River."
    ],
    "tips_and_tricks": [
      "Bring waterproof gear for activities near the falls.",
      "Plan your visit during the dry season for the best views.",
      "Book activities in advance, especially during peak season."
    ],
    "emergency_contacts": {
      "tour_guide": "+263 13 47010",
      "local_police": "999",
      "embassy": "+263 4 700 610"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Victoria Falls",
        "activities": [
          "Arrival at Victoria Falls International Airport and transfer to the hotel.",
          "Briefing on the tour and rest.",
          "Dinner at The Boma, experiencing traditional Zimbabwean dishes and entertainment."
        ]
      },
      {
        "day": 2,
        "location": "Victoria Falls National Park",
        "activities": [
          "Visit Victoria Falls National Park and explore various viewpoints.",
          "Enjoy a guided tour of the falls and learn about its history.",
          "Lunch at The Lookout Cafe with stunning views.",
          "Free time for optional activities such as helicopter rides.",
          "Dinner and overnight stay at the hotel."
        ]
      },
      {
        "day": 3,
        "location": "Zambezi River",
        "activities": [
          "Morning adventure of white-water rafting on the Zambezi River.",
          "Lunch at a local restaurant.",
          "Relaxation time at the hotel or enjoy spa services.",
          "Evening sunset cruise on the Zambezi River.",
          "Dinner at a restaurant overlooking the river."
        ]
      },
      {
        "day": 4,
        "location": "Livingstone Island and Departure",
        "activities": [
          "Visit Livingstone Island for breathtaking views and swimming in the Devil’s Pool.",
          "Lunch at a nearby café.",
          "Free afternoon for last-minute shopping or exploration.",
          "Check-out from the hotel and transfer to the airport for departure."
        ]
      }
    ],
    "customer_reviews": [
      {
        "name": "James K.",
        "rating": 5.0,
        "description": "Victoria Falls is a breathtaking sight! The tour was well-organized, and we loved every moment."
      },
      {
        "name": "Olivia M.",
        "rating": 4.8,
        "description": "The sunset cruise was the highlight of my trip. The views are stunning!"
      }
    ]
  }
  