{
    "package_name": "Yogyakarta Cultural Tour",
    "country": "Indonesia",
    "region": "Yogyakarta",
    "duration_days": 4,
    "customer_rating": 4.8,
    "tour_cost_usd": 1000,
    "region_description": "Yogyakarta, often referred to as Jogja, is a cultural hub of Indonesia, known for its rich history, traditional arts, and stunning temples. The city is famous for its proximity to the iconic Borobudur and Prambanan temples, both UNESCO World Heritage Sites. Yogyakarta is also known for its batik arts, traditional performances, and vibrant street food scene. The city’s unique blend of Javanese culture and modern influences makes it an exciting destination for travelers seeking a deeper understanding of Indonesia’s heritage.",
    "places_to_visit": [
      {
        "name": "Borobudur Temple",
        "description": "Borobudur Temple is the largest Buddhist temple in the world and a UNESCO World Heritage Site. The temple is renowned for its stunning architecture, intricate relief panels, and numerous stupas. Visitors can climb to the top for breathtaking views of the surrounding landscape."
      },
      {
        "name": "Prambanan Temple",
        "description": "Prambanan Temple is a magnificent Hindu temple complex and another UNESCO World Heritage Site. Known for its tall, pointed architecture and intricate carvings, Prambanan is dedicated to the Trimurti of Hinduism: Brahma, Vishnu, and Shiva."
      },
      {
        "name": "Kraton (Sultan's Palace)",
        "description": "The Kraton is the official residence of the Sultan of Yogyakarta. The palace complex showcases traditional Javanese architecture and houses a museum displaying artifacts from the royal family and cultural performances."
      },
      {
        "name": "Malioboro Street",
        "description": "Malioboro Street is a bustling shopping area and cultural hub in Yogyakarta. The street is lined with shops, street vendors, and restaurants, offering a variety of souvenirs, local snacks, and traditional crafts."
      }
    ],
    "hotels_and_restaurants": [
      {
        "location": "Yogyakarta",
        "hotels": [
          {
            "name": "Hotel Tentrem Yogyakarta",
            "description": "Hotel Tentrem Yogyakarta is a luxurious hotel offering elegant accommodations, a spa, and an outdoor pool. Its central location makes it convenient for exploring Yogyakarta's attractions.",
            "cost_per_night_usd": 150
          },
          {
            "name": "Adhisthana Hotel",
            "description": "Adhisthana Hotel is a charming boutique hotel with traditional Javanese decor. It offers comfortable rooms, a pool, and easy access to local attractions.",
            "cost_per_night_usd": 80
          }
        ],
        "restaurants": [
          {
            "name": "Kedai Kopi Kita",
            "description": "Kedai Kopi Kita is a popular café known for its traditional Javanese coffee and local snacks. The cozy atmosphere makes it a great spot to relax and enjoy the local flavors.",
            "average_cost_per_person_usd": 10
          },
          {
            "name": "Bubur Ayam Yogyakarta",
            "description": "Bubur Ayam Yogyakarta specializes in traditional Indonesian chicken porridge. The restaurant offers a simple menu and is loved for its delicious, comforting dishes.",
            "average_cost_per_person_usd": 5
          }
        ]
      }
    ],
    "activities": [
      "Visit Borobudur Temple and explore its intricate architecture.",
      "Discover Prambanan Temple and learn about its historical significance.",
      "Tour the Kraton (Sultan's Palace) and witness cultural performances.",
      "Shop and dine along Malioboro Street."
    ],
    "tips_and_tricks": [
      "Wear comfortable shoes for exploring temples and walking around the city.",
      "Negotiate prices when shopping in local markets.",
      "Try local specialties like Gudeg and Bakpia."
    ],
    "emergency_contacts": {
      "tour_guide": "+62 812 1234 5678",
      "local_police": "110",
      "embassy": "+62 21 3456 7890"
    },
    "timeline": [
      {
        "day": 1,
        "location": "Yogyakarta",
        "activities": [
          "Arrival at Adisucipto International Airport and transfer to the hotel.",
          "Briefing on the tour and overview of Yogyakarta's attractions.",
          "Evening at leisure to explore nearby areas.",
          "Dinner at a local restaurant, enjoying traditional Indonesian cuisine."
        ]
      },
      {
        "day": 2,
        "location": "Borobudur",
        "activities": [
          "Visit Borobudur Temple in the morning and explore its grounds.",
          "Lunch at a local restaurant near Borobudur.",
          "Visit the nearby Mendut Temple before returning to Yogyakarta.",
          "Evening at leisure in Yogyakarta."
        ]
      },
      {
        "day": 3,
        "location": "Prambanan",
        "activities": [
          "Visit Prambanan Temple in the morning for sightseeing.",
          "Lunch at a local restaurant with local dishes.",
          "Explore the Kraton (Sultan's Palace) in the afternoon.",
          "Evening cultural performance at the palace."
        ]
      },
      {
        "day": 4,
        "location": "Malioboro and Departure",
        "activities": [
          "Visit Malioboro Street for shopping and local snacks.",
          "Lunch at a local café, trying traditional Javanese coffee.",
          "Check-out from the hotel and transfer to the airport for departure."
        ]
      }
    ],
    "customer_reviews": [
      {
        "name": "Rina W.",
        "rating": 5,
        "description": "Yogyakarta is full of culture and history! Loved every moment of the tour!"
      },
      {
        "name": "John D.",
        "rating": 4.8,
        "description": "Borobudur and Prambanan were incredible! Highly recommend this tour."
      }
    ]
  }
  